# Pandas TP avoid

In [285]:
import pandas as pd

In [286]:
df=pd.read_csv("layoffs.csv")

In [287]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [171]:
df1['population'].sum()

139812000

In [289]:
df.dtypes

company                   object
location                  object
industry                  object
total_laid_off           float64
percentage_laid_off      float64
date                      object
stage                     object
country                   object
funds_raised_millions    float64
dtype: object

In [290]:
### Count of rows

In [291]:
df.count()

company                  2361
location                 2361
industry                 2357
total_laid_off           1621
percentage_laid_off      1576
date                     2360
stage                    2355
country                  2361
funds_raised_millions    2152
dtype: int64

In [292]:
df.isnull().sum()

company                    0
location                   0
industry                   4
total_laid_off           740
percentage_laid_off      785
date                       1
stage                      6
country                    0
funds_raised_millions    209
dtype: int64

In [293]:
df[df["industry"].isnull()]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
8,Airbnb,SF Bay Area,NaN,30.0,NaN,3/3/2023,Post-IPO,United States,6400.0
330,Bally's Interactive,Providence,NaN,NaN,0.15,1/18/2023,Post-IPO,United States,946.0
736,Juul,SF Bay Area,NaN,400.0,0.30,11/10/2022,Unknown,United States,1500.0
1595,Carvana,Phoenix,NaN,2500.0,0.12,5/10/2022,Post-IPO,United States,1600.0

In [294]:
df["industry"].nunique()

32

In [295]:
df[df["country"]== "India"]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
14,Fittr,Pune,Fitness,30.0,0.11,3/2/2023,Series A,India,13.0
16,Flipkart,Bengaluru,Retail,NaN,NaN,3/2/2023,Acquired,India,12900.0
29,DUX Education,Bengaluru,Education,NaN,1.00,2/28/2023,Unknown,India,NaN
40,SAP Labs,Bengaluru,Other,300.0,NaN,2/24/2023,Subsidiary,India,1300.0
...,...,...,...,...,...,...,...,...,...
2221,Acko,Mumbai,Finance,45.0,0.09,4/1/2020,Unknown,India,143.0
2253,FabHotels,New Delhi,Travel,80.0,0.20,3/30/2020,Series B,India,48.0
2267,TravelTriangle,Gurugram,Travel,250.0,0.50,3/28/2020,Series D,India,47.0
2294,Fareportal,Gurugram,Travel,200.0,NaN,3/26/2020,Unknown,India,NaN
2341,Bounce,Bengaluru,Transportation,120.0,NaN,3/19/2020,Series D,India,214.0

In [296]:
df.isnull().sum()

company                    0
location                   0
industry                   4
total_laid_off           740
percentage_laid_off      785
date                       1
stage                      6
country                    0
funds_raised_millions    209
dtype: int64

In [297]:
df.count()

company                  2361
location                 2361
industry                 2357
total_laid_off           1621
percentage_laid_off      1576
date                     2360
stage                    2355
country                  2361
funds_raised_millions    2152
dtype: int64

In [298]:
df.shape

(2361, 9)

In [299]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2361 entries, 0 to 2360
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   company                2361 non-null   object
 1   location               2361 non-null   object
 2   industry               2357 non-null   object
 3   total_laid_off         1621 non-null   float64
 4   percentage_laid_off    1576 non-null   float64
 5   date                   2360 non-null   object
 6   stage                  2355 non-null   object
 7   country                2361 non-null   object
 8   funds_raised_millions  2152 non-null   float64
dtypes: float64(3), object(6)
memory usage: 166.1+ KB

In [300]:
df.head(n=10)

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
1,SiriusXM,New York City,Media,475.0,0.08,3/6/2023,Post-IPO,United States,525.0
2,Alerzo,Ibadan,Retail,400.0,NaN,3/6/2023,Series B,Nigeria,16.0
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
4,Loft,Sao Paulo,Real Estate,340.0,0.15,3/3/2023,Unknown,Brazil,788.0
5,Embark Trucks,SF Bay Area,Transportation,230.0,0.70,3/3/2023,Post-IPO,United States,317.0
6,Lendi,Sydney,Real Estate,100.0,NaN,3/3/2023,Unknown,Australia,59.0
7,UserTesting,SF Bay Area,Marketing,63.0,NaN,3/3/2023,Acquired,United States,152.0
8,Airbnb,SF Bay Area,NaN,30.0,NaN,3/3/2023,Post-IPO,United States,6400.0
9,Accolade,Seattle,Healthcare,NaN,NaN,3/3/2023,Post-IPO,United States,458.0

In [301]:
df.tail()

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
2356,Blackbaud,Charleston,Other,500.0,0.14,NaN,Post-IPO,United States,NaN
2357,Yahoo,SF Bay Area,Consumer,1600.0,0.20,2/9/2023,Acquired,United States,6.0
2358,Hibob,Tel Aviv,HR,70.0,0.30,3/30/2020,Series A,Israel,45.0
2359,Casper,New York City,Retail,NaN,NaN,9/14/2021,Post-IPO,United States,339.0
2360,Wildlife Studios,Sao Paulo,Consumer,300.0,0.20,11/28/2022,Unknown,Brazil,260.0

df.describe()

In [302]:
df.dtypes

company                   object
location                  object
industry                  object
total_laid_off           float64
percentage_laid_off      float64
date                      object
stage                     object
country                   object
funds_raised_millions    float64
dtype: object

In [169]:
df

NameError: name 'df' is not defined

# Pandas Basic 1 (dtypes,shape,head(),tail(),describe(),info())

In [303]:
df

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
1,SiriusXM,New York City,Media,475.0,0.08,3/6/2023,Post-IPO,United States,525.0
2,Alerzo,Ibadan,Retail,400.0,NaN,3/6/2023,Series B,Nigeria,16.0
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
4,Loft,Sao Paulo,Real Estate,340.0,0.15,3/3/2023,Unknown,Brazil,788.0
...,...,...,...,...,...,...,...,...,...
2356,Blackbaud,Charleston,Other,500.0,0.14,NaN,Post-IPO,United States,NaN
2357,Yahoo,SF Bay Area,Consumer,1600.0,0.20,2/9/2023,Acquired,United States,6.0
2358,Hibob,Tel Aviv,HR,70.0,0.30,3/30/2020,Series A,Israel,45.0
2359,Casper,New York City,Retail,NaN,NaN,9/14/2021,Post-IPO,United States,339.0
2360,Wildlife Studios,Sao Paulo,Consumer,300.0,0.20,11/28/2022,Unknown,Brazil,260.0

### dtypes -- It is udes to find the datatypes of the datframe

In [304]:
df.dtypes

company                   object
location                  object
industry                  object
total_laid_off           float64
percentage_laid_off      float64
date                      object
stage                     object
country                   object
funds_raised_millions    float64
dtype: object

### shape it will give the count of table rows and column rows

In [305]:
df.shape

(2361, 9)

In [306]:
##Or
sh=df.shape
print(f"Total number of rows are {sh[0]} and columns are {sh[1]}")

Total number of rows are 2361 and columns are 9

### info() -- It is used to find the data types as well as non-null-values in the columns

In [307]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2361 entries, 0 to 2360
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   company                2361 non-null   object
 1   location               2361 non-null   object
 2   industry               2357 non-null   object
 3   total_laid_off         1621 non-null   float64
 4   percentage_laid_off    1576 non-null   float64
 5   date                   2360 non-null   object
 6   stage                  2355 non-null   object
 7   country                2361 non-null   object
 8   funds_raised_millions  2152 non-null   float64
dtypes: float64(3), object(6)
memory usage: 166.1+ KB

### Display first 5 rows and last 5 rows or more

In [308]:
df.head() #first 5 rows

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
1,SiriusXM,New York City,Media,475.0,0.08,3/6/2023,Post-IPO,United States,525.0
2,Alerzo,Ibadan,Retail,400.0,NaN,3/6/2023,Series B,Nigeria,16.0
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
4,Loft,Sao Paulo,Real Estate,340.0,0.15,3/3/2023,Unknown,Brazil,788.0

In [309]:
df.head(n=10) #first 10 rows

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
1,SiriusXM,New York City,Media,475.0,0.08,3/6/2023,Post-IPO,United States,525.0
2,Alerzo,Ibadan,Retail,400.0,NaN,3/6/2023,Series B,Nigeria,16.0
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
4,Loft,Sao Paulo,Real Estate,340.0,0.15,3/3/2023,Unknown,Brazil,788.0
5,Embark Trucks,SF Bay Area,Transportation,230.0,0.70,3/3/2023,Post-IPO,United States,317.0
6,Lendi,Sydney,Real Estate,100.0,NaN,3/3/2023,Unknown,Australia,59.0
7,UserTesting,SF Bay Area,Marketing,63.0,NaN,3/3/2023,Acquired,United States,152.0
8,Airbnb,SF Bay Area,NaN,30.0,NaN,3/3/2023,Post-IPO,United States,6400.0
9,Accolade,Seattle,Healthcare,NaN,NaN,3/3/2023,Post-IPO,United States,458.0

In [310]:
df.tail()

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
2356,Blackbaud,Charleston,Other,500.0,0.14,NaN,Post-IPO,United States,NaN
2357,Yahoo,SF Bay Area,Consumer,1600.0,0.20,2/9/2023,Acquired,United States,6.0
2358,Hibob,Tel Aviv,HR,70.0,0.30,3/30/2020,Series A,Israel,45.0
2359,Casper,New York City,Retail,NaN,NaN,9/14/2021,Post-IPO,United States,339.0
2360,Wildlife Studios,Sao Paulo,Consumer,300.0,0.20,11/28/2022,Unknown,Brazil,260.0

In [311]:
df.tail(n=10)

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
2351,Service,Los Angeles,Travel,NaN,1.00,3/16/2020,Seed,United States,5.1
2352,HopSkipDrive,Los Angeles,Transportation,8.0,0.10,3/13/2020,Unknown,United States,45.0
2353,Panda Squad,SF Bay Area,Consumer,6.0,0.75,3/13/2020,Seed,United States,1.0
2354,Tamara Mellon,Los Angeles,Retail,20.0,0.40,3/12/2020,Series C,United States,90.0
2355,EasyPost,Salt Lake City,Logistics,75.0,NaN,3/11/2020,Series A,United States,12.0
2356,Blackbaud,Charleston,Other,500.0,0.14,NaN,Post-IPO,United States,NaN
2357,Yahoo,SF Bay Area,Consumer,1600.0,0.20,2/9/2023,Acquired,United States,6.0
2358,Hibob,Tel Aviv,HR,70.0,0.30,3/30/2020,Series A,Israel,45.0
2359,Casper,New York City,Retail,NaN,NaN,9/14/2021,Post-IPO,United States,339.0
2360,Wildlife Studios,Sao Paulo,Consumer,300.0,0.20,11/28/2022,Unknown,Brazil,260.0

# Count(),isnull() and Distinct[unique(),nunique()]

## null count and count

### to display total number of count in the table for each row

In [312]:
df.count()

company                  2361
location                 2361
industry                 2357
total_laid_off           1621
percentage_laid_off      1576
date                     2360
stage                    2355
country                  2361
funds_raised_millions    2152
dtype: int64

### to display count of particulat column

In [313]:
df["total_laid_off"].count()

1621

In [314]:
#or :-)
count_ctry=df["country"].count()
print(f"Count in the country column  is {count_ctry} ")

Count in the country column  is 2361

### to display total number of null count in the table for each row

In [315]:
df.isnull().sum()

company                    0
location                   0
industry                   4
total_laid_off           740
percentage_laid_off      785
date                       1
stage                      6
country                    0
funds_raised_millions    209
dtype: int64

### to display null records of the table

In [458]:
df[df.isnull().any(axis=1)]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
2,Alerzo,Ibadan,Retail,400.0,NaN,3/6/2023,Series B,Nigeria,16.0
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
6,Lendi,Sydney,Real Estate,100.0,NaN,3/3/2023,Unknown,Australia,59.0
7,UserTesting,SF Bay Area,Marketing,63.0,NaN,3/3/2023,Acquired,United States,152.0
8,Airbnb,SF Bay Area,NaN,30.0,NaN,3/3/2023,Post-IPO,United States,6400.0
...,...,...,...,...,...,...,...,...,...
2347,Tuft & Needle,Phoenix,Retail,NaN,NaN,3/19/2020,Acquired,United States,0.0
2351,Service,Los Angeles,Travel,NaN,1.00,3/16/2020,Seed,United States,5.1
2355,EasyPost,Salt Lake City,Logistics,75.0,NaN,3/11/2020,Series A,United States,12.0
2356,Blackbaud,Charleston,Other,500.0,0.14,NaN,Post-IPO,United States,NaN
2359,Casper,New York City,Retail,NaN,NaN,9/14/2021,Post-IPO,United States,339.0

### to display tota number of null in particular column

In [316]:
df["total_laid_off"].isnull().sum()

740

In [317]:
#or:-)
l_off=df["total_laid_off"].isnull().sum()
print(f"total number of null in total_laid_off column are {l_off}")

total number of null in total_laid_off column are 740

## Distinct

### Distinct/unique records of particular column of dataframe/table

In [318]:
df['industry'].unique()

array(['Other', 'Media', 'Retail', 'Education', 'Real Estate',
       'Transportation', 'Marketing', nan, 'Healthcare', 'Security',
       'Food', 'Fitness', 'Consumer', 'Logistics', 'HR', 'Support',
       'Travel', 'Crypto', 'Finance', 'Data', 'Sales', 'Infrastructure',
       'Hardware', 'Product', 'Construction', 'Legal', 'Energy',
       'Manufacturing', 'Recruiting', 'Aerospace', 'Crypto Currency',
       'Fin-Tech', 'CryptoCurrency'], dtype=object)

### Distinct/unique count records of all the  column of dataframe/table

In [319]:
df.nunique()

company                  1893
location                  191
industry                   32
total_laid_off            285
percentage_laid_off        73
date                      483
stage                      16
country                    60
funds_raised_millions     638
dtype: int64

### Distinct/unique count records of particular  column of dataframe/table

In [320]:
df['industry'].nunique()

32

# Filter and Select note:- multiple filter in Operators(logincal operators)

In [321]:
df

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
1,SiriusXM,New York City,Media,475.0,0.08,3/6/2023,Post-IPO,United States,525.0
2,Alerzo,Ibadan,Retail,400.0,NaN,3/6/2023,Series B,Nigeria,16.0
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
4,Loft,Sao Paulo,Real Estate,340.0,0.15,3/3/2023,Unknown,Brazil,788.0
...,...,...,...,...,...,...,...,...,...
2356,Blackbaud,Charleston,Other,500.0,0.14,NaN,Post-IPO,United States,NaN
2357,Yahoo,SF Bay Area,Consumer,1600.0,0.20,2/9/2023,Acquired,United States,6.0
2358,Hibob,Tel Aviv,HR,70.0,0.30,3/30/2020,Series A,Israel,45.0
2359,Casper,New York City,Retail,NaN,NaN,9/14/2021,Post-IPO,United States,339.0
2360,Wildlife Studios,Sao Paulo,Consumer,300.0,0.20,11/28/2022,Unknown,Brazil,260.0

### select particular columns

In [322]:
df["company"]

0              Atlassian
1               SiriusXM
2                 Alerzo
3                 UpGrad
4                   Loft
              ...
2356           Blackbaud
2357               Yahoo
2358               Hibob
2359              Casper
2360    Wildlife Studios
Name: company, Length: 2361, dtype: object

### select multiple columns

In [323]:
df[['company','location']]

               company       location
0            Atlassian         Sydney
1             SiriusXM  New York City
2               Alerzo         Ibadan
3               UpGrad         Mumbai
4                 Loft      Sao Paulo
...                ...            ...
2356         Blackbaud     Charleston
2357             Yahoo    SF Bay Area
2358             Hibob       Tel Aviv
2359            Casper  New York City
2360  Wildlife Studios      Sao Paulo

[2361 rows x 2 columns]

In [324]:
#or :-)
fil=["company","location"]
df[fil]

               company       location
0            Atlassian         Sydney
1             SiriusXM  New York City
2               Alerzo         Ibadan
3               UpGrad         Mumbai
4                 Loft      Sao Paulo
...                ...            ...
2356         Blackbaud     Charleston
2357             Yahoo    SF Bay Area
2358             Hibob       Tel Aviv
2359            Casper  New York City
2360  Wildlife Studios      Sao Paulo

[2361 rows x 2 columns]

### Filter country column column and filter where country is India

In [325]:
df[df['country']=='India']

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
14,Fittr,Pune,Fitness,30.0,0.11,3/2/2023,Series A,India,13.0
16,Flipkart,Bengaluru,Retail,NaN,NaN,3/2/2023,Acquired,India,12900.0
29,DUX Education,Bengaluru,Education,NaN,1.00,2/28/2023,Unknown,India,NaN
40,SAP Labs,Bengaluru,Other,300.0,NaN,2/24/2023,Subsidiary,India,1300.0
...,...,...,...,...,...,...,...,...,...
2221,Acko,Mumbai,Finance,45.0,0.09,4/1/2020,Unknown,India,143.0
2253,FabHotels,New Delhi,Travel,80.0,0.20,3/30/2020,Series B,India,48.0
2267,TravelTriangle,Gurugram,Travel,250.0,0.50,3/28/2020,Series D,India,47.0
2294,Fareportal,Gurugram,Travel,200.0,NaN,3/26/2020,Unknown,India,NaN
2341,Bounce,Bengaluru,Transportation,120.0,NaN,3/19/2020,Series D,India,214.0

### Filter country column column and filter where country is India and just select particular column

In [326]:
df[df['country']=='India']['company']

3               UpGrad
14               Fittr
16            Flipkart
29       DUX Education
40            SAP Labs
             ...
2221              Acko
2253         FabHotels
2267    TravelTriangle
2294        Fareportal
2341            Bounce
Name: company, Length: 148, dtype: object

### Filter country column column and filter where country is India and select multiple column

In [327]:
df[df['country']=='India'][['company','location','stage']]

             company   location       stage
3             UpGrad     Mumbai     Unknown
14             Fittr       Pune    Series A
16          Flipkart  Bengaluru    Acquired
29     DUX Education  Bengaluru     Unknown
40          SAP Labs  Bengaluru  Subsidiary
...              ...        ...         ...
2221            Acko     Mumbai     Unknown
2253       FabHotels  New Delhi    Series B
2267  TravelTriangle   Gurugram    Series D
2294      Fareportal   Gurugram     Unknown
2341          Bounce  Bengaluru    Series D

[148 rows x 3 columns]

### Filter according to index in below case 1 is starting index and 5 is last index same like python it will not display end index

In [328]:
df[1:5]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
1,SiriusXM,New York City,Media,475.0,0.08,3/6/2023,Post-IPO,United States,525.0
2,Alerzo,Ibadan,Retail,400.0,NaN,3/6/2023,Series B,Nigeria,16.0
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
4,Loft,Sao Paulo,Real Estate,340.0,0.15,3/3/2023,Unknown,Brazil,788.0

### Filter according to index for particular column of table in below case 1 is starting index and 5 is last index same like python it will not display end index

In [329]:
df['company'][1:5]

1    SiriusXM
2      Alerzo
3      UpGrad
4        Loft
Name: company, dtype: object

# Operators df2 is mention here

## Logical Operators (& as and,| as or,~ as not),between,isin

In [330]:
df

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
1,SiriusXM,New York City,Media,475.0,0.08,3/6/2023,Post-IPO,United States,525.0
2,Alerzo,Ibadan,Retail,400.0,NaN,3/6/2023,Series B,Nigeria,16.0
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
4,Loft,Sao Paulo,Real Estate,340.0,0.15,3/3/2023,Unknown,Brazil,788.0
...,...,...,...,...,...,...,...,...,...
2356,Blackbaud,Charleston,Other,500.0,0.14,NaN,Post-IPO,United States,NaN
2357,Yahoo,SF Bay Area,Consumer,1600.0,0.20,2/9/2023,Acquired,United States,6.0
2358,Hibob,Tel Aviv,HR,70.0,0.30,3/30/2020,Series A,Israel,45.0
2359,Casper,New York City,Retail,NaN,NaN,9/14/2021,Post-IPO,United States,339.0
2360,Wildlife Studios,Sao Paulo,Consumer,300.0,0.20,11/28/2022,Unknown,Brazil,260.0

## &(and) operator

In [331]:
df[(df['location']=='Mumbai') & (df['country']=='India')]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
115,TikTok India,Mumbai,Consumer,40.0,NaN,2/10/2023,Acquired,India,9400.0
153,Pocket Aces,Mumbai,Media,50.0,0.25,2/6/2023,Unknown,India,19.0
361,Rebel Foods,Mumbai,Food,NaN,0.02,1/16/2023,Unknown,India,548.0
364,BharatAgri,Mumbai,Food,40.0,0.43,1/15/2023,Series A,India,21.0
395,CoinDCX,Mumbai,Crypto,80.0,NaN,1/11/2023,Series D,India,244.0
411,LEAD,Mumbai,Education,60.0,NaN,1/10/2023,Series E,India,190.0
516,PharmEasy,Mumbai,Healthcare,NaN,NaN,12/10/2022,Unknown,India,1600.0
836,GoNuts,Mumbai,Media,NaN,1.00,10/27/2022,Seed,India,NaN
928,WazirX,Mumbai,Crypto,60.0,0.40,10/2/2022,Acquired,India,NaN
995,Lido Learning,Mumbai,Education,NaN,1.00,9/9/2022,Series C,India,20.0
1143,LEAD,Mumbai,Education,80.0,0.04,8/4/2022,Series E,India,166.0
1289,Fraazo,Mumbai,Food,150.0,NaN,7/12/2022,Series B,India,63.0
1352,Toppr,Mumbai,Education,350.0,NaN,6/29/2022,Acquired,India,112.0
1369,WhiteHat Jr,Mumbai,Education,300.0,NaN,6/28/2022,Acquired,India,11.0
1438,PharmEasy,Mumbai,Healthcare,40.0,NaN,6/16/2022,Unknown,India,1600.0
1506,Eruditus,Mumbai,Education,40.0,NaN,6/4/2022,Series E,India,1200.0
1664,Lido,Mumbai,Education,150.0,NaN,2/21/2022,Series A,India,24.0
1712,Bytedance,Mumbai,Consumer,1800.0,NaN,1/27/2021,Unknown,India,7400.0
1721,WhiteHat Jr,Mumbai,Education,1800.0,NaN,1/6/2021,Acquired,India,11.0
1798,Bizongo,Mumbai,Logistics,140.0,NaN,7/10/2020,Series C,India,70.0
1800,PaySense,Mumbai,Finance,40.0,NaN,7/9/2020,Acquired,India,25.6
1858,BookMyShow,Mumbai,Consumer,270.0,0.18,5/28/2020,Unknown,India,224.0
2055,CleverTap,Mumbai,Marketing,60.0,0.20,4/16/2020,Series C,India,76.0
2064,Shop101,Mumbai,Retail,200.0,0.40,4/15/2020,Series C,India,19.0
2221,Acko,Mumbai,Finance,45.0,0.09,4/1/2020,Unknown,India,143.0

### &(and) operator with single select

In [332]:
df[(df['location']=='Mumbai') & (df['country']=='India')]['stage']

3        Unknown
115     Acquired
153      Unknown
361      Unknown
364     Series A
395     Series D
411     Series E
516      Unknown
836         Seed
928     Acquired
995     Series C
1143    Series E
1289    Series B
1352    Acquired
1369    Acquired
1438     Unknown
1506    Series E
1664    Series A
1712     Unknown
1721    Acquired
1798    Series C
1800    Acquired
1858     Unknown
2055    Series C
2064    Series C
2221     Unknown
Name: stage, dtype: object

### &(and) operator with multiple select

In [333]:
df[(df['location']=='Mumbai') & (df['country']=='India')][['stage','company']]

         stage        company
3      Unknown         UpGrad
115   Acquired   TikTok India
153    Unknown    Pocket Aces
361    Unknown    Rebel Foods
364   Series A     BharatAgri
395   Series D        CoinDCX
411   Series E           LEAD
516    Unknown      PharmEasy
836       Seed         GoNuts
928   Acquired         WazirX
995   Series C  Lido Learning
1143  Series E           LEAD
1289  Series B         Fraazo
1352  Acquired          Toppr
1369  Acquired    WhiteHat Jr
1438   Unknown      PharmEasy
1506  Series E       Eruditus
1664  Series A           Lido
1712   Unknown      Bytedance
1721  Acquired    WhiteHat Jr
1798  Series C        Bizongo
1800  Acquired       PaySense
1858   Unknown     BookMyShow
2055  Series C      CleverTap
2064  Series C        Shop101
2221   Unknown           Acko

## |(or) operator

In [334]:
df[(df['country']=='India') | (df['location']=='Sydney')]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
6,Lendi,Sydney,Real Estate,100.0,NaN,3/3/2023,Unknown,Australia,59.0
14,Fittr,Pune,Fitness,30.0,0.11,3/2/2023,Series A,India,13.0
16,Flipkart,Bengaluru,Retail,NaN,NaN,3/2/2023,Acquired,India,12900.0
...,...,...,...,...,...,...,...,...,...
2221,Acko,Mumbai,Finance,45.0,0.09,4/1/2020,Unknown,India,143.0
2253,FabHotels,New Delhi,Travel,80.0,0.20,3/30/2020,Series B,India,48.0
2267,TravelTriangle,Gurugram,Travel,250.0,0.50,3/28/2020,Series D,India,47.0
2294,Fareportal,Gurugram,Travel,200.0,NaN,3/26/2020,Unknown,India,NaN
2341,Bounce,Bengaluru,Transportation,120.0,NaN,3/19/2020,Series D,India,214.0

### |(or) operator with single select

In [335]:
df[(df['country']=='India') | (df['location']=='Sydney')]['industry']

0                Other
3            Education
6          Real Estate
14             Fitness
16              Retail
             ...
2221           Finance
2253            Travel
2267            Travel
2294            Travel
2341    Transportation
Name: industry, Length: 185, dtype: object

### |(or) operator with multi select

In [336]:
df[(df['country']=='India') | (df['location']=='Sydney')][['industry','company']]

            industry         company
0              Other       Atlassian
3          Education          UpGrad
6        Real Estate           Lendi
14           Fitness           Fittr
16            Retail        Flipkart
...              ...             ...
2221         Finance            Acko
2253          Travel       FabHotels
2267          Travel  TravelTriangle
2294          Travel      Fareportal
2341  Transportation          Bounce

[185 rows x 2 columns]

## multiple operator

In [337]:
df[(df['location']=='India') & (df['country']=='India') | (df['industry']=='Other')]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
10,Indigo,Boston,Other,NaN,NaN,3/3/2023,Series F,United States.,1200.0
19,Thoughtworks,Chicago,Other,500.0,0.04,3/1/2023,Post-IPO,United States,748.0
39,Ericsson,Stockholm,Other,8500.0,0.08,2/24/2023,Post-IPO,Sweden,663.0
40,SAP Labs,Bengaluru,Other,300.0,NaN,2/24/2023,Subsidiary,India,1300.0
...,...,...,...,...,...,...,...,...,...
2072,Dude Solutions,Raleigh,Other,NaN,0.20,4/15/2020,Acquired,United States,100.0
2213,Wonder,New York City,Other,NaN,NaN,4/2/2020,Unknown,United States,NaN
2258,Catalant,Boston,Other,30.0,NaN,3/30/2020,Series E,United States,110.0
2300,Consider.co,SF Bay Area,Other,13.0,1.00,3/26/2020,Seed,United States,5.0
2356,Blackbaud,Charleston,Other,500.0,0.14,NaN,Post-IPO,United States,NaN

## between and isin([])

### isin selected single column we have to pass list in isin()

In [338]:
df[df['country'].isin(['India'])]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
14,Fittr,Pune,Fitness,30.0,0.11,3/2/2023,Series A,India,13.0
16,Flipkart,Bengaluru,Retail,NaN,NaN,3/2/2023,Acquired,India,12900.0
29,DUX Education,Bengaluru,Education,NaN,1.00,2/28/2023,Unknown,India,NaN
40,SAP Labs,Bengaluru,Other,300.0,NaN,2/24/2023,Subsidiary,India,1300.0
...,...,...,...,...,...,...,...,...,...
2221,Acko,Mumbai,Finance,45.0,0.09,4/1/2020,Unknown,India,143.0
2253,FabHotels,New Delhi,Travel,80.0,0.20,3/30/2020,Series B,India,48.0
2267,TravelTriangle,Gurugram,Travel,250.0,0.50,3/28/2020,Series D,India,47.0
2294,Fareportal,Gurugram,Travel,200.0,NaN,3/26/2020,Unknown,India,NaN
2341,Bounce,Bengaluru,Transportation,120.0,NaN,3/19/2020,Series D,India,214.0

### isin selected multiple column

In [339]:
df[df['country'].isin(['India','Brazil'])]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
4,Loft,Sao Paulo,Real Estate,340.0,0.15,3/3/2023,Unknown,Brazil,788.0
13,Ambev Tech,Blumenau,Food,50.0,NaN,3/2/2023,Acquired,Brazil,NaN
14,Fittr,Pune,Fitness,30.0,0.11,3/2/2023,Series A,India,13.0
16,Flipkart,Bengaluru,Retail,NaN,NaN,3/2/2023,Acquired,India,12900.0
...,...,...,...,...,...,...,...,...,...
2284,Loft,Sao Paulo,Real Estate,47.0,NaN,3/27/2020,Series C,Brazil,263.0
2290,Bcredi,Curitiba,Finance,NaN,NaN,3/27/2020,Series A,Brazil,NaN
2294,Fareportal,Gurugram,Travel,200.0,NaN,3/26/2020,Unknown,India,NaN
2341,Bounce,Bengaluru,Transportation,120.0,NaN,3/19/2020,Series D,India,214.0
2360,Wildlife Studios,Sao Paulo,Consumer,300.0,0.20,11/28/2022,Unknown,Brazil,260.0

### isin selected multiple column and single and multiple select

In [340]:
df[df['country'].isin(['India','Brazil'])]['stage']

3        Unknown
4        Unknown
13      Acquired
14      Series A
16      Acquired
          ...
2284    Series C
2290    Series A
2294     Unknown
2341    Series D
2360     Unknown
Name: stage, Length: 225, dtype: object

In [341]:
df[df['country'].isin(['India','Brazil'])][['stage','company']]

         stage           company
3      Unknown            UpGrad
4      Unknown              Loft
13    Acquired        Ambev Tech
14    Series A             Fittr
16    Acquired          Flipkart
...        ...               ...
2284  Series C              Loft
2290  Series A            Bcredi
2294   Unknown        Fareportal
2341  Series D            Bounce
2360   Unknown  Wildlife Studios

[225 rows x 2 columns]

### ~(not) isin([])

In [342]:
df[~df['country'].isin(['India'])]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
1,SiriusXM,New York City,Media,475.0,0.08,3/6/2023,Post-IPO,United States,525.0
2,Alerzo,Ibadan,Retail,400.0,NaN,3/6/2023,Series B,Nigeria,16.0
4,Loft,Sao Paulo,Real Estate,340.0,0.15,3/3/2023,Unknown,Brazil,788.0
5,Embark Trucks,SF Bay Area,Transportation,230.0,0.70,3/3/2023,Post-IPO,United States,317.0
...,...,...,...,...,...,...,...,...,...
2356,Blackbaud,Charleston,Other,500.0,0.14,NaN,Post-IPO,United States,NaN
2357,Yahoo,SF Bay Area,Consumer,1600.0,0.20,2/9/2023,Acquired,United States,6.0
2358,Hibob,Tel Aviv,HR,70.0,0.30,3/30/2020,Series A,Israel,45.0
2359,Casper,New York City,Retail,NaN,NaN,9/14/2021,Post-IPO,United States,339.0
2360,Wildlife Studios,Sao Paulo,Consumer,300.0,0.20,11/28/2022,Unknown,Brazil,260.0

### between()

In [777]:
df2=pd.read_csv("pokemon.csv")

In [778]:
df2

,Id,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,80,110,120,130,90,70,6,True

In [345]:
df2[df2['Speed'].between(40,43)]

,Id,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
9,7,Squirtle,Water,NaN,44,48,65,50,64,43,1,False
32,27,Sandshrew,Ground,NaN,50,75,85,20,30,40,1,False
34,29,Nidoran (Female),Poison,NaN,55,47,52,40,40,41,1,False
49,44,Gloom,Grass,Poison,60,65,70,85,75,40,1,False
75,69,Bellsprout,Grass,Poison,50,75,35,70,30,40,1,False
97,90,Shellder,Water,NaN,30,65,100,45,25,40,1,False
104,96,Drowzee,Psychic,NaN,60,48,45,43,90,42,1,False
110,102,Exeggcute,Grass,Psychic,60,40,80,60,45,40,1,False
120,112,Rhydon,Ground,Rock,105,130,120,45,45,40,1,False
148,137,Porygon,Normal,NaN,65,60,70,85,75,40,1,False
172,158,Totodile,Water,NaN,50,65,64,44,48,43,2,False
182,168,Ariados,Bug,Poison,70,90,70,60,60,40,2,False
190,176,Togetic,Fairy,Flying,55,40,85,80,105,40,2,False
198,183,Marill,Water,Fairy,70,20,50,20,50,40,2,False
220,205,Forretress,Bug,Steel,75,90,140,60,60,40,2,False
234,216,Teddiursa,Normal,NaN,60,80,50,50,50,40,2,False
250,231,Phanpy,Ground,NaN,90,60,60,40,40,40,2,False
265,246,Larvitar,Rock,Ground,50,64,50,45,50,41,2,False
280,258,Mudkip,Water,NaN,50,70,50,50,50,40,3,False
303,280,Ralts,Psychic,Fairy,28,25,25,45,35,40,3,False
314,290,Nincada,Bug,Ground,31,45,90,30,30,40,3,False
316,292,Shedinja,Bug,Ghost,1,90,45,30,30,40,3,False
331,305,Lairon,Steel,Rock,60,90,140,50,50,40,3,False
345,316,Gulpin,Poison,NaN,70,43,53,43,53,40,3,False
353,323,Camerupt,Fire,Ground,70,100,70,105,75,40,3,False
378,346,Cradily,Rock,Grass,86,81,97,81,107,43,3,False
384,352,Kecleon,Normal,NaN,60,90,70,60,120,40,3,False
438,393,Piplup,Water,NaN,53,51,53,61,56,40,4,False
463,416,Vespiquen,Bug,Flying,70,80,102,80,102,40,4,False
491,443,Gible,Dragon,Ground,58,70,45,40,45,42,4,False
509,459,Snover,Grass,Ice,60,62,50,62,60,40,4,False
515,464,Rhyperior,Ground,Rock,115,140,130,55,55,40,4,False
528,476,Probopass,Rock,Steel,60,55,145,75,150,40,4,False
563,504,Patrat,Normal,NaN,45,55,39,35,39,42,5,False
578,519,Pidove,Normal,Flying,50,55,50,36,30,43,5,False
593,533,Gurdurr,Fighting,NaN,85,105,85,40,50,40,5,False
600,540,Sewaddle,Bug,Grass,45,53,70,40,60,42,5,False
601,541,Swadloon,Bug,Grass,55,63,90,50,80,42,5,False
653,592,Frillish,Water,Ghost,55,40,50,65,85,40,5,False
664,603,Eelektrik,Electric,NaN,65,85,70,75,70,40,5,False
667,606,Beheeyem,Psychic,NaN,75,75,75,125,95,40,5,False
674,613,Cubchoo,Ice,NaN,55,70,40,60,40,40,5,False
737,669,Flabébé,Fairy,NaN,44,38,39,61,79,42,6,False
742,674,Pancham,Fighting,NaN,67,82,62,46,48,43,6,False
774,704,Goomy,Dragon,NaN,45,50,35,55,75,40,6,False
783,710,PumpkabooSuper Size,Ghost,Grass,59,66,70,44,55,41,6,False

### not between()

In [346]:
df2[~df2['Id'].between(12,800)]

,Id,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False
5,5,Charmeleon,Fire,NaN,58,64,58,80,65,80,1,False
6,6,Charizard,Fire,Flying,78,84,78,109,85,100,1,False
7,6,CharizardMega Charizard X,Fire,Dragon,78,130,111,130,85,100,1,False
8,6,CharizardMega Charizard Y,Fire,Flying,78,104,78,159,115,100,1,False
9,7,Squirtle,Water,NaN,44,48,65,50,64,43,1,False
10,8,Wartortle,Water,NaN,59,63,80,65,80,58,1,False
11,9,Blastoise,Water,NaN,79,83,100,85,105,78,1,False
12,9,BlastoiseMega Blastoise,Water,NaN,79,103,120,135,115,78,1,False
13,10,Caterpie,Bug,NaN,45,30,35,20,20,45,1,False
14,11,Metapod,Bug,NaN,50,20,55,25,25,30,1,False

# Comparision Operator (==,>=,<=,!=)

In [347]:
df2.columns=[columns.replace(" ","") for columns in df2]

In [348]:
df2.columns

Index(['Id', 'Name', 'Type1', 'Type2', 'HP', 'Attack', 'Defense', 'Sp.Atk',
       'Sp.Def', 'Speed', 'Generation', 'Legendary'],
      dtype='object')

## == Operator

### == with comparision operators

In [349]:
df2[df2['Attack']==49]#

,Id,Name,Type1,Type2,HP,Attack,Defense,Sp.Atk,Sp.Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
166,152,Chikorita,Grass,NaN,45,49,65,49,65,45,2,False
506,456,Finneon,Water,NaN,49,49,56,49,61,66,4,False

### == with comparision and logical operators &(and)

In [350]:
df2[(df2['Attack']==49) & (df2['Generation']==1)]

,Id,Name,Type1,Type2,HP,Attack,Defense,Sp.Atk,Sp.Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False

### == with comparision and logical operators |(or)

In [351]:
df2[(df2['Attack']==49) | (df2['Generation']==1)]

,Id,Name,Type1,Type2,HP,Attack,Defense,Sp.Atk,Sp.Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...
163,150,MewtwoMega Mewtwo X,Psychic,Fighting,106,190,100,154,100,130,1,True
164,150,MewtwoMega Mewtwo Y,Psychic,NaN,106,150,70,194,120,140,1,True
165,151,Mew,Psychic,NaN,100,100,100,100,100,100,1,False
166,152,Chikorita,Grass,NaN,45,49,65,49,65,45,2,False
506,456,Finneon,Water,NaN,49,49,56,49,61,66,4,False

### == with comparision and logical operators &(and) also isin()

In [352]:
df2[(df2['Attack'].isin([49,63])) & (df2['Generation']==1)]

,Id,Name,Type1,Type2,HP,Attack,Defense,Sp.Atk,Sp.Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
10,8,Wartortle,Water,NaN,59,63,80,65,80,58,1,False

### == with comparision and logical operators or(|) also isin()

In [353]:
df2[(df2['Attack'].isin([49,63])) | (df2['Generation']==1)]

,Id,Name,Type1,Type2,HP,Attack,Defense,Sp.Atk,Sp.Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...
482,434,Stunky,Poison,Dark,63,63,47,41,41,74,4,False
506,456,Finneon,Water,NaN,49,49,56,49,61,66,4,False
557,498,Tepig,Fire,NaN,65,63,45,45,45,45,5,False
601,541,Swadloon,Bug,Grass,55,63,90,50,80,42,5,False
725,657,Frogadier,Water,NaN,54,63,52,83,56,97,6,False

## >= Operator

In [354]:
df2[df2['Attack']>=100]

,Id,Name,Type1,Type2,HP,Attack,Defense,Sp.Atk,Sp.Def,Speed,Generation,Legendary
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
7,6,CharizardMega Charizard X,Fire,Dragon,78,130,111,130,85,100,1,False
8,6,CharizardMega Charizard Y,Fire,Flying,78,104,78,159,115,100,1,False
12,9,BlastoiseMega Blastoise,Water,NaN,79,103,120,135,115,78,1,False
19,15,BeedrillMega Beedrill,Bug,Poison,65,150,40,15,80,145,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,80,110,120,130,90,70,6,True

## <= Operator

In [355]:
df2[df2['Attack']>=100]

,Id,Name,Type1,Type2,HP,Attack,Defense,Sp.Atk,Sp.Def,Speed,Generation,Legendary
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
7,6,CharizardMega Charizard X,Fire,Dragon,78,130,111,130,85,100,1,False
8,6,CharizardMega Charizard Y,Fire,Flying,78,104,78,159,115,100,1,False
12,9,BlastoiseMega Blastoise,Water,NaN,79,103,120,135,115,78,1,False
19,15,BeedrillMega Beedrill,Bug,Poison,65,150,40,15,80,145,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,80,110,120,130,90,70,6,True

## != Operator

In [356]:
df2[df2['Attack']!=100]

,Id,Name,Type1,Type2,HP,Attack,Defense,Sp.Atk,Sp.Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False
5,5,Charmeleon,Fire,NaN,58,64,58,80,65,80,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...
793,717,Yveltal,Dark,Flying,126,131,95,131,98,99,6,True
796,719,DiancieMega Diancie,Rock,Fairy,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,80,110,120,130,90,70,6,True

# Like operator

### str.contains('',na=) like '%sd%' in sql

In [360]:
df[df['company'].str.contains('tl',na=False)]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
190,Bustle Digital Group,New York City,Media,NaN,0.08,2/1/2023,Series E,United States,80.0
591,Netlify,SF Bay Area,Product,48.0,0.16,12/1/2022,Series D,United States,212.0
709,Oatly,Malmö,Food,NaN,NaN,11/15/2022,Post-IPO,Sweden,441.0
783,Planetly,Berlin,Other,200.0,1.00,11/4/2022,Acquired,Germany,5.0
822,Brightline,SF Bay Area,Healthcare,NaN,0.20,11/1/2022,Series C,United States,212.0
1303,Butler Hospitality,New York City,Food,1000.0,1.00,7/8/2022,Series B,United States,50.0
1666,Trustly,Stockholm,Finance,120.0,NaN,2/17/2022,Acquired,Sweden,28.0
1825,Atlas Obscura,New York City,Media,15.0,NaN,6/18/2020,Series B,United States,32.0
1841,Lastline,SF Bay Area,Security,50.0,0.40,6/4/2020,Series C,United States,52.0
1952,Castlight Health,SF Bay Area,Healthcare,NaN,0.13,5/4/2020,Post-IPO,United States,184.0
2173,Bustle Digital Group,New York City,Media,24.0,0.08,4/3/2020,Series E,United States,80.0
2174,Bustle Digital Group,New York City,Media,19.0,NaN,4/3/2020,Series E,United States,80.0
2198,Shuttl,New Delhi,Transportation,40.0,NaN,4/2/2020,Series C,India,122.0
2209,Atlanta Tech Village,Atlanta,Real Estate,NaN,0.50,4/2/2020,Unknown,United States,NaN

In [362]:
### str.contains('A',na=) like 'A%' in sql

In [361]:
df[df['company'].str.startswith('A', na=False)]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
2,Alerzo,Ibadan,Retail,400.0,NaN,3/6/2023,Series B,Nigeria,16.0
8,Airbnb,SF Bay Area,NaN,30.0,NaN,3/3/2023,Post-IPO,United States,6400.0
9,Accolade,Seattle,Healthcare,NaN,NaN,3/3/2023,Post-IPO,United States,458.0
13,Ambev Tech,Blumenau,Food,50.0,NaN,3/2/2023,Acquired,Brazil,NaN
...,...,...,...,...,...,...,...,...,...
2236,AdRoll,Salt Lake City,Marketing,210.0,0.30,3/31/2020,Series C,United States,89.0
2242,AngelList,SF Bay Area,Recruiting,20.0,NaN,3/31/2020,Series B,United States,26.0
2245,Adara,SF Bay Area,Travel,NaN,NaN,3/31/2020,Series C,United States,67.0
2265,Amplero,Seattle,Marketing,17.0,1.00,3/29/2020,Series B,United States,25.0
2345,Anyvision,Tel Aviv,Security,NaN,NaN,3/19/2020,Series A,Israel,74.0

In [363]:
df[df['company'].str.endswith('n',na=False)]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
29,DUX Education,Bengaluru,Education,NaN,1.00,2/28/2023,Unknown,India,NaN
39,Ericsson,Stockholm,Other,8500.0,0.08,2/24/2023,Post-IPO,Sweden,663.0
60,Locomation,Pittsburgh,Transportation,NaN,1.00,2/22/2023,Seed,United States,57.0
61,Polygon,Bengaluru,Crypto,100.0,0.20,2/21/2023,Unknown,India,451.0
...,...,...,...,...,...,...,...,...,...
2285,Oh My Green,SF Bay Area,Food,40.0,NaN,3/27/2020,Seed,United States,20.0
2332,Cabin,SF Bay Area,Travel,NaN,0.20,3/23/2020,Seed,United States,3.0
2345,Anyvision,Tel Aviv,Security,NaN,NaN,3/19/2020,Series A,Israel,74.0
2346,Popin,New York City,Fitness,NaN,1.00,3/19/2020,Unknown,United States,13.0
2354,Tamara Mellon,Los Angeles,Retail,20.0,0.40,3/12/2020,Series C,United States,90.0

In [364]:
df[(df['company'].str.endswith('n',na=False)) & (df['company'].str.startswith('A',na=False))]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
329,Aiven,Helsinki,Infrastructure,NaN,0.20,1/18/2023,Series D,Finland,420.0
453,Amazon,Seattle,Retail,8000.0,0.02,1/4/2023,Post-IPO,United States,108.0
681,Amazon,Seattle,Retail,10000.0,0.03,11/16/2022,Post-IPO,United States,108.0
829,Amazon,Seattle,Retail,150.0,NaN,10/28/2022,Post-IPO,United States,108.0
926,ActiveCampaign,Chicago,Marketing,NaN,0.15,10/3/2022,Series C,United States,360.0
1379,AppLovin,SF Bay Area,Marketing,300.0,0.12,6/27/2022,Post-IPO,United States,1600.0
1425,Aqgromalin,Chennai,Food,80.0,0.30,6/20/2022,Unknown,India,12.0
2181,Alegion,Austin,Data,NaN,NaN,4/3/2020,Series A,United States,16.0
2345,Anyvision,Tel Aviv,Security,NaN,NaN,3/19/2020,Series A,Israel,74.0

In [377]:
df[df['company'].str.contains(r'.t*s.i..$',na=False)]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
7,UserTesting,SF Bay Area,Marketing,63.0,NaN,3/3/2023,Acquired,United States,152.0
325,Hootsuite,Vancouver,Marketing,70.0,0.07,1/18/2023,Series C,Canada,300.0
335,Lucid Diagnostics,New York City,Healthcare,NaN,0.20,1/18/2023,Post-IPO,United States,NaN
819,Hootsuite,Vancouver,Marketing,50.0,0.05,11/1/2022,Series C,Canada,300.0
997,Pomelo Fashion,Bangkok,Retail,55.0,0.08,9/8/2022,Unknown,Thailand,120.0
1110,Hootsuite,Vancouver,Marketing,400.0,0.30,8/9/2022,Series C,Canada,300.0
1171,Glossier,New York City,Retail,19.0,0.08,8/2/2022,Series E,United States,266.0
1175,Classkick,Chicago,Education,NaN,NaN,8/1/2022,Seed,United States,1.0
1268,Aspire,SF Bay Area,Marketing,23.0,NaN,7/15/2022,Series A,United States,27.0
1616,Domestika,SF Bay Area,Education,150.0,0.19,4/28/2022,Series D,United States,130.0
1675,Glossier,New York City,Consumer,80.0,0.33,1/26/2022,Series E,United States,266.0
1733,Worksmith,Austin,Retail,30.0,0.50,11/9/2020,Unknown,United States,3.8
1776,Glossier,New York City,Retail,150.0,0.38,8/7/2020,Series D,United States,186.4
2038,Motif Investing,SF Bay Area,Finance,NaN,1.00,4/18/2020,Series E,United States,126.0
2169,Arrive Logistics,Austin,Logistics,75.0,0.07,4/3/2020,Series B,United States,35.0
2208,Synergysuite,Salt Lake City,Food,5.0,0.07,4/2/2020,Series A,United States,6.0

In [373]:
df[df['company'].str.contains(r'.*i..$', na=False)]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
7,UserTesting,SF Bay Area,Marketing,63.0,NaN,3/3/2023,Acquired,United States,152.0
10,Indigo,Boston,Other,NaN,NaN,3/3/2023,Series F,United States.,1200.0
28,Eventbrite,SF Bay Area,Consumer,80.0,0.08,2/28/2023,Post-IPO,United States,557.0
29,DUX Education,Bengaluru,Education,NaN,1.00,2/28/2023,Unknown,India,NaN
...,...,...,...,...,...,...,...,...,...
2339,Service,Los Angeles,Travel,NaN,1.00,3/20/2020,Seed,United States,5.0
2345,Anyvision,Tel Aviv,Security,NaN,NaN,3/19/2020,Series A,Israel,74.0
2351,Service,Los Angeles,Travel,NaN,1.00,3/16/2020,Seed,United States,5.1
2352,HopSkipDrive,Los Angeles,Transportation,8.0,0.10,3/13/2020,Unknown,United States,45.0
2360,Wildlife Studios,Sao Paulo,Consumer,300.0,0.20,11/28/2022,Unknown,Brazil,260.0

# Group By groupby() pending yet to start

In [390]:
df.groupby('company').value_counts()

company       location       industry    total_laid_off  percentage_laid_off  date        stage     country        funds_raised_millions
#Paid         Toronto        Marketing   19.0            0.17                 1/27/2023   Series B  Canada         21.0                     1
&Open         Dublin         Marketing   9.0             0.09                 11/17/2022  Series A  Ireland        35.0                     1
10X Genomics  SF Bay Area    Healthcare  100.0           0.08                 8/4/2022    Post-IPO  United States  242.0                    1
1stdibs       New York City  Retail      70.0            0.17                 4/2/2020    Series D  United States  253.0                    1
2TM           Sao Paulo      Crypto      90.0            0.12                 6/1/2022    Unknown   Brazil         250.0                    1
                                                                                                                                           ..
iPrice Group  Kuala Lumpur   Retail      50.0            0.20                 6/8/2022    Unknown   Malaysia       26.0                     1
iRobot        Boston         Consumer    85.0            0.07                 2/13/2023   Acquired  United States  30.0                     1
                                         140.0           0.10                 8/5/2022    Acquired  United States  30.0                     1
nCino         Wilmington     Finance     100.0           0.07                 1/18/2023   Post-IPO  United States  1100.0                   1
uShip         Austin         Logistics   65.0            0.37                 3/31/2020   Series D  United States  69.0                     1
Name: count, Length: 1088, dtype: int64

In [395]:
df.value_counts()

company           location       industry        total_laid_off  percentage_laid_off  date        stage     country         funds_raised_millions
Hibob             Tel Aviv       HR              70.0            0.30                 3/30/2020   Series A  Israel          45.0                     2
Yahoo             SF Bay Area    Consumer        1600.0          0.20                 2/9/2023    Acquired  United States   6.0                      2
Wildlife Studios  Sao Paulo      Consumer        300.0           0.20                 11/28/2022  Unknown   Brazil          260.0                    2
Cazoo             London         Transportation  750.0           0.15                 6/7/2022    Post-IPO  United Kingdom  2000.0                   2
#Paid             Toronto        Marketing       19.0            0.17                 1/27/2023   Series B  Canada          21.0                     1
                                                                                                                                                    ..
Grin              Sacramento     Marketing       60.0            0.13                 11/30/2022  Series B  United States   145.0                    1
Group Nine Media  New York City  Media           50.0            0.07                 4/7/2020    Unknown   United States   190.0                    1
Groupon           Chicago        Retail          500.0           0.15                 8/8/2022    Post-IPO  United States   1400.0                   1
                                                 2800.0          0.44                 4/13/2020   Post-IPO  United States   1400.0                   1
uShip             Austin         Logistics       65.0            0.37                 3/31/2020   Series D  United States   69.0                     1
Name: count, Length: 1088, dtype: int64

In [403]:
df.groupby('country')[['location','industry']].value_counts()

country         location          industry
Argentina       Buenos Aires      Crypto            2
                                  Food              1
                                  Marketing         1
                                  Other             1
                                  Finance           1
                                                   ..
United States.  Boston            Other             1
                Birmingham        Real Estate       1
Uruguay         Montevideo        Transportation    1
Vietnam         Ho Chi Minh City  Real Estate       2
                Hanoi             Fitness           1
Name: count, Length: 768, dtype: int64

In [422]:
res=df.groupby('country')[['location','company']].value_counts().reset_index()
res[res['count']==2]

            country          location     company  count
6         Australia            Sydney     Nearmap      2
7         Australia            Sydney        Voly      2
8         Australia            Sydney   Immutable      2
9         Australia            Sydney     Brighte      2
10        Australia            Sydney   Booktopia      2
...             ...               ...         ...    ...
913   United States           Chicago     ThredUp      2
914   United States     New York City  LivePerson      2
915   United States   Washington D.C.      Mapbox      2
916   United States           Chicago    SpotHero      2
1940        Vietnam  Ho Chi Minh City      Propzy      2

[259 rows x 4 columns]

In [437]:
df['country'].value_counts()

country
United States           1541
India                    148
Canada                    99
Brazil                    77
United Kingdom            74
Germany                   68
Israel                    56
Australia                 54
Singapore                 34
Indonesia                 24
Sweden                    20
China                     18
Nigeria                   15
Netherlands               13
France                     7
United Arab Emirates       6
Kenya                      6
Argentina                  6
Hong Kong                  5
Estonia                    5
Ireland                    5
Colombia                   4
Mexico                     4
Seychelles                 4
Norway                     4
Finland                    4
Denmark                    4
United States.             4
Chile                      3
Portugal                   3
Austria                    3
Vietnam                    3
Malaysia                   3
Pakistan                   3
Luxembourg                 3
Spain                      3
New Zealand                2
Switzerland                2
Egypt                      2
South Korea                2
Belgium                    1
Peru                       1
Czech Republic             1
South Africa               1
Bulgaria                   1
Uruguay                    1
Russia                     1
Turkey                     1
Romania                    1
Bahrain                    1
Japan                      1
Poland                     1
Senegal                    1
Ghana                      1
Lithuania                  1
Thailand                   1
Italy                      1
Hungary                    1
Greece                     1
Myanmar                    1
Name: count, dtype: int64

In [440]:
df.groupby('country').count().reset_index()

,country,company,location,industry,total_laid_off,percentage_laid_off,date,stage,funds_raised_millions
0,Argentina,6,6,6,5,4,6,6,4
1,Australia,54,54,54,28,38,54,54,46
2,Austria,3,3,3,3,1,3,3,3
3,Bahrain,1,1,1,0,0,1,1,1
4,Belgium,1,1,1,0,0,1,1,1
5,Brazil,77,77,77,67,57,77,77,64
6,Bulgaria,1,1,1,1,1,1,1,0
7,Canada,99,99,99,81,76,99,99,89
8,Chile,3,3,3,1,1,3,3,3
9,China,18,18,18,9,7,18,18,16
10,Colombia,4,4,4,2,1,4,4,4
11,Czech Republic,1,1,1,0,0,1,1,1
12,Denmark,4,4,4,4,2,4,4,4
13,Egypt,2,2,2,0,1,2,2,2
14,Estonia,5,5,5,5,3,5,5,5
15,Finland,4,4,4,1,3,4,4,4
16,France,7,7,7,5,3,7,7,7
17,Germany,68,68,68,55,47,68,68,65
18,Ghana,1,1,1,0,0,1,1,0
19,Greece,1,1,1,0,0,1,1,1
20,Hong Kong,5,5,5,3,4,5,5,4
21,Hungary,1,1,1,0,1,1,1,1
22,India,148,148,148,126,85,148,147,139
23,Indonesia,24,24,24,13,17,24,24,18
24,Ireland,5,5,5,4,3,5,5,4
25,Israel,56,56,56,46,42,56,56,52
26,Italy,1,1,1,0,1,1,1,1
27,Japan,1,1,1,1,0,1,1,1
28,Kenya,6,6,6,4,6,6,6,6
29,Lithuania,1,1,1,1,0,1,1,1
30,Luxembourg,3,3,3,1,2,3,3,1
31,Malaysia,3,3,3,2,3,3,3,3
32,Mexico,4,4,4,3,3,4,4,4
33,Myanmar,1,1,1,1,1,1,1,0
34,Netherlands,13,13,13,9,10,13,13,6
35,New Zealand,2,2,2,1,0,2,2,2
36,Nigeria,15,15,15,10,6,15,15,12
37,Norway,4,4,4,2,2,4,4,4
38,Pakistan,3,3,3,0,3,3,3,3
39,Peru,1,1,1,0,0,1,1,1
40,Poland,1,1,1,1,0,1,1,1
41,Portugal,3,3,3,2,1,3,3,3
42,Romania,1,1,1,1,0,1,1,1
43,Russia,1,1,1,1,1,1,1,1
44,Senegal,1,1,1,1,1,1,1,1
45,Seychelles,4,4,4,1,3,4,4,4
46,Singapore,34,34,34,22,25,34,34,27
47,South Africa,1,1,1,0,0,1,1,1
48,South Korea,2,2,2,0,1,2,2,2
49,Spain,3,3,3,1,2,3,3,3
50,Sweden,20,20,20,16,12,20,20,19
51,Switzerland,2,2,2,1,1,2,2,1
52,Thailand,1,1,1,1,1,1,1,1
53,Turkey,1,1,1,0,1,1,1,1
54,United Arab Emirates,6,6,6,4,6,6,6,5
55,United Kingdom,74,74,74,47,51,74,73,66
56,United States,1541,1541,1537,1025,1031,1540,1537,1424
57,United States.,4,4,4,3,2,4,4,4
58,Uruguay,1,1,1,0,0,1,1,1
59,Vietnam,3,3,3,0,3,3,3,3

In [441]:
df2

,Id,Name,Type1,Type2,HP,Attack,Defense,Sp.Atk,Sp.Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,80,110,120,130,90,70,6,True

In [447]:
df2.groupby('Type1').count().reset_index()

,Type1,Id,Name,Type2,HP,Attack,Defense,Sp.Atk,Sp.Def,Speed,Generation,Legendary
0,Bug,69,69,52,69,69,69,69,69,69,69,69
1,Dark,31,31,21,31,31,31,31,31,31,31,31
2,Dragon,32,32,21,32,32,32,32,32,32,32,32
3,Electric,44,44,17,44,44,44,44,44,44,44,44
4,Fairy,17,17,2,17,17,17,17,17,17,17,17
5,Fighting,27,27,7,27,27,27,27,27,27,27,27
6,Fire,52,52,24,52,52,52,52,52,52,52,52
7,Flying,4,4,2,4,4,4,4,4,4,4,4
8,Ghost,32,32,22,32,32,32,32,32,32,32,32
9,Grass,70,70,37,70,70,70,70,70,70,70,70
10,Ground,32,32,19,32,32,32,32,32,32,32,32
11,Ice,24,24,11,24,24,24,24,24,24,24,24
12,Normal,98,98,37,98,98,98,98,98,98,98,98
13,Poison,28,28,13,28,28,28,28,28,28,28,28
14,Psychic,57,57,19,57,57,57,57,57,57,57,57
15,Rock,44,44,35,44,44,44,44,44,44,44,44
16,Steel,27,27,22,27,27,27,27,27,27,27,27
17,Water,112,112,53,112,112,112,112,112,112,112,112

In [449]:
df2[df2['Type2']=='Rock'].isnull().sum()

Id            0
Name          0
Type1         0
Type2         0
HP            0
Attack        0
Defense       0
Sp.Atk        0
Sp.Def        0
Speed         0
Generation    0
Legendary     0
dtype: int64

In [452]:
df2[df2['Type1']=="Rock"].isnull().sum()

Id            0
Name          0
Type1         0
Type2         9
HP            0
Attack        0
Defense       0
Sp.Atk        0
Sp.Def        0
Speed         0
Generation    0
Legendary     0
dtype: int64

In [537]:
df2

,Id,Name,Type1,Type2,HP,Attack,Defense,Sp.Atk,Sp.Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,80,110,120,130,90,70,6,True

In [542]:
df2.groupby(['Type1','Type2']).agg({'Attack':['max','min','count']})

               Attack
                  max  min count
Type1 Type2
Bug   Electric     77   47     2
      Fighting    185  125     2
      Fire         85   60     2
      Flying      155   20    14
      Ghost        90   90     1
...               ...  ...   ...
Water Ice          95   70     3
      Poison       95   40     3
      Psychic      75   65     5
      Rock        108   55     4
      Steel        86   86     1

[136 rows x 3 columns]

# Order by

In [779]:
df2.sort_values('Attack',ascending=1)

,Id,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
488,440,Happiny,Normal,NaN,100,5,5,15,65,30,4,False
121,113,Chansey,Normal,NaN,250,5,5,35,105,50,1,False
230,213,Shuckle,Bug,Rock,20,10,230,10,230,5,2,False
261,242,Blissey,Normal,NaN,255,10,10,75,135,55,2,False
139,129,Magikarp,Water,NaN,20,10,55,15,20,80,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...
429,386,DeoxysAttack Forme,Psychic,NaN,50,180,20,180,20,150,3,True
426,384,RayquazaMega Rayquaza,Dragon,Flying,105,180,100,180,100,115,3,True
424,383,GroudonPrimal Groudon,Ground,Fire,100,180,160,150,90,90,3,True
232,214,HeracrossMega Heracross,Bug,Fighting,80,185,115,40,105,75,2,False
163,150,MewtwoMega Mewtwo X,Psychic,Fighting,106,190,100,154,100,130,1,True

In [468]:
df2.sort_values('Attack',ascending=0)

,Id,Name,Type1,Type2,HP,Attack,Defense,Sp.Atk,Sp.Def,Speed,Generation,Legendary
163,150,MewtwoMega Mewtwo X,Psychic,Fighting,106,190,100,154,100,130,1,True
232,214,HeracrossMega Heracross,Bug,Fighting,80,185,115,40,105,75,2,False
424,383,GroudonPrimal Groudon,Ground,Fire,100,180,160,150,90,90,3,True
426,384,RayquazaMega Rayquaza,Dragon,Flying,105,180,100,180,100,115,3,True
429,386,DeoxysAttack Forme,Psychic,NaN,50,180,20,180,20,150,3,True
...,...,...,...,...,...,...,...,...,...,...,...,...
139,129,Magikarp,Water,NaN,20,10,55,15,20,80,1,False
261,242,Blissey,Normal,NaN,255,10,10,75,135,55,2,False
230,213,Shuckle,Bug,Rock,20,10,230,10,230,5,2,False
121,113,Chansey,Normal,NaN,250,5,5,35,105,50,1,False
488,440,Happiny,Normal,NaN,100,5,5,15,65,30,4,False

In [477]:
df2.sort_values(['Attack','Defense'],ascending=[0,0])

,Id,Name,Type1,Type2,HP,Attack,Defense,Sp.Atk,Sp.Def,Speed,Generation,Legendary
163,150,MewtwoMega Mewtwo X,Psychic,Fighting,106,190,100,154,100,130,1,True
232,214,HeracrossMega Heracross,Bug,Fighting,80,185,115,40,105,75,2,False
424,383,GroudonPrimal Groudon,Ground,Fire,100,180,160,150,90,90,3,True
426,384,RayquazaMega Rayquaza,Dragon,Flying,105,180,100,180,100,115,3,True
429,386,DeoxysAttack Forme,Psychic,NaN,50,180,20,180,20,150,3,True
...,...,...,...,...,...,...,...,...,...,...,...,...
230,213,Shuckle,Bug,Rock,20,10,230,10,230,5,2,False
139,129,Magikarp,Water,NaN,20,10,55,15,20,80,1,False
261,242,Blissey,Normal,NaN,255,10,10,75,135,55,2,False
121,113,Chansey,Normal,NaN,250,5,5,35,105,50,1,False
488,440,Happiny,Normal,NaN,100,5,5,15,65,30,4,False

In [785]:
df2[df2['Type 1']=='Bug'].sort_values('Attack',ascending=1)

,Id,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
230,213,Shuckle,Bug,Rock,20,10,230,10,230,5,2,False
14,11,Metapod,Bug,NaN,50,20,55,25,25,30,1,False
179,165,Ledyba,Bug,Flying,40,20,30,40,80,55,2,False
733,665,Spewpa,Bug,NaN,45,22,60,27,30,29,6,False
446,401,Kricketot,Bug,NaN,37,25,41,25,41,25,4,False
...,...,...,...,...,...,...,...,...,...,...,...,...
650,589,Escavalier,Bug,Steel,70,135,105,60,105,20,5,False
229,212,ScizorMega Scizor,Bug,Steel,70,150,140,65,100,75,2,False
19,15,BeedrillMega Beedrill,Bug,Poison,65,150,40,15,80,145,1,False
137,127,PinsirMega Pinsir,Bug,Flying,65,155,120,65,90,105,1,False
232,214,HeracrossMega Heracross,Bug,Fighting,80,185,115,40,105,75,2,False

In [793]:
df2[df2['Type 1']=='Bug']['Attack'].max()

185

In [799]:
dd=df2.groupby('Type 1').agg({'Attack':['max','min']}).reset_index()

In [807]:
dd['Attack']

    max  min
0   185   10
1   150   50
2   180   50
3   123   30
4   131   20
5   145   35
6   160   30
7   115   30
8   165   30
9   132   27
10  180   40
11  130   30
12  160    5
13  106   43
14  190   20
15  165   40
16  150   24
17  155   10

In [485]:

df2.groupby('Attack').apply(lambda x: x.sort_values('Attack', ascending=True)).reset_index(drop=True)

,Id,Name,Type1,Type2,HP,Attack,Defense,Sp.Atk,Sp.Def,Speed,Generation,Legendary
0,113,Chansey,Normal,NaN,250,5,5,35,105,50,1,False
1,440,Happiny,Normal,NaN,100,5,5,15,65,30,4,False
2,129,Magikarp,Water,NaN,20,10,55,15,20,80,1,False
3,213,Shuckle,Bug,Rock,20,10,230,10,230,5,2,False
4,242,Blissey,Normal,NaN,255,10,10,75,135,55,2,False
...,...,...,...,...,...,...,...,...,...,...,...,...
795,383,GroudonPrimal Groudon,Ground,Fire,100,180,160,150,90,90,3,True
796,384,RayquazaMega Rayquaza,Dragon,Flying,105,180,100,180,100,115,3,True
797,386,DeoxysAttack Forme,Psychic,NaN,50,180,20,180,20,150,3,True
798,214,HeracrossMega Heracross,Bug,Fighting,80,185,115,40,105,75,2,False
799,150,MewtwoMega Mewtwo X,Psychic,Fighting,106,190,100,154,100,130,1,True

In [489]:
df2['Attack'].nlargest().reset_index(drop=1)

0    190
1    185
2    180
3    180
4    180
Name: Attack, dtype: int64

# Concatination

In [505]:
df3=df2.copy()

In [506]:
df3

,Id,Name,Type1,Type2,HP,Attack,Defense,Sp.Atk,Sp.Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,80,110,120,130,90,70,6,True

In [508]:
df3['NameType']=df3['Name'].astype(str)+' '+df3['Type1'].astype(str)

In [509]:
df3

,Id,Name,Type1,Type2,HP,Attack,Defense,Sp.Atk,Sp.Def,Speed,Generation,Legendary,NameType
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False,Bulbasaur Grass
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False,Ivysaur Grass
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False,Venusaur Grass
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False,VenusaurMega Venusaur Grass
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False,Charmander Fire
...,...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,50,100,150,100,150,50,6,True,Diancie Rock
796,719,DiancieMega Diancie,Rock,Fairy,50,160,110,160,110,110,6,True,DiancieMega Diancie Rock
797,720,HoopaHoopa Confined,Psychic,Ghost,80,110,60,150,130,70,6,True,HoopaHoopa Confined Psychic
798,720,HoopaHoopa Unbound,Psychic,Dark,80,160,60,170,130,80,6,True,HoopaHoopa Unbound Psychic
799,721,Volcanion,Fire,Water,80,110,120,130,90,70,6,True,Volcanion Fire

In [512]:
df3['Attack']+df3['Defense']

0       98
1      125
2      165
3      223
4       95
      ...
795    250
796    270
797    170
798    220
799    230
Length: 800, dtype: int64

# Case Statement

In [517]:
df4=pd.read_csv("ab.csv")

In [514]:
df4

         order_id product_name         category       city  sales  profit
0  CA-2020-152156           p1        Furniture  Bangalore  10000     500
1  CA-2020-138688           p2        Furniture  Bangalore  20000     400
2  US-2019-108966           p3       Technology    Chennai  25000     200
3  CA-2021-114412           p4  Office Supplies    Chennai  30000     250
4  CA-2020-161389           p5       Technology     Mysore  35000     800
5  US-2019-118983           p6  Office Supplies     Mysore  40000     700

In [519]:
import numpy as np
condition=[
    (df4['profit']<250),
    (df4['profit']>=250) & (df4['profit']<=500),
    (df4['profit']>500)
]
results=['low','medum','high']
df4['status']=np.select(condition,results,default='Unknown')
df4

,order_id,product_name,category,city,sales,profit,status
0,CA-2020-152156,p1,Furniture,Bangalore,10000,500,medum
1,CA-2020-138688,p2,Furniture,Bangalore,20000,400,medum
2,US-2019-108966,p3,Technology,Chennai,25000,200,low
3,CA-2021-114412,p4,Office Supplies,Chennai,30000,250,medum
4,CA-2020-161389,p5,Technology,Mysore,35000,800,high
5,US-2019-118983,p6,Office Supplies,Mysore,40000,700,high

In [527]:
df4.loc[df4['city']=='Chennai','state']='TN'
df4.loc[df4['city'].isin(['Bangalore','Mysore']),'state']='Karnataka'

In [528]:
df4

,order_id,product_name,category,city,sales,profit,status,state
0,CA-2020-152156,p1,Furniture,Bangalore,10000,500,medum,Karnataka
1,CA-2020-138688,p2,Furniture,Bangalore,20000,400,medum,Karnataka
2,US-2019-108966,p3,Technology,Chennai,25000,200,low,TN
3,CA-2021-114412,p4,Office Supplies,Chennai,30000,250,medum,TN
4,CA-2020-161389,p5,Technology,Mysore,35000,800,high,Karnataka
5,US-2019-118983,p6,Office Supplies,Mysore,40000,700,high,Karnataka

# Date and time

In [550]:
df=pd.read_csv('http://bit.ly/uforeports')

In [551]:
df

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59

In [552]:
df.dtypes

City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
dtype: object

In [556]:
df['Time']=pd.to_datetime(df['Time'])

In [557]:
df.dtypes

City                       object
Colors Reported            object
Shape Reported             object
State                      object
Time               datetime64[ns]
dtype: object

In [558]:
df

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,2000-12-31 23:00:00
18237,Spirit Lake,NaN,DISK,IA,2000-12-31 23:00:00
18238,Eagle River,NaN,NaN,WI,2000-12-31 23:45:00
18239,Eagle River,RED,LIGHT,WI,2000-12-31 23:45:00
18240,Ybor,NaN,OVAL,FL,2000-12-31 23:59:00

In [559]:
df2=df.copy()

In [563]:
df2['newtime']=pd.to_datetime(df2['Time']) ##,format='%d-%Y-%m %H:%M:%S' give date format according to data

In [566]:
df.dtypes

City                       object
Colors Reported            object
Shape Reported             object
State                      object
Time               datetime64[ns]
dtype: object

In [567]:
## Year,month,day and lot

In [587]:
# Convert to display format 'dd-mm-yyyy' for the Time column
df2['Formatted_Time'] = df2['Time'].dt.strftime('%d-%m-%Y')

In [582]:
df2.dtypes

City                       object
Colors Reported            object
Shape Reported             object
State                      object
Time               datetime64[ns]
newtime            datetime64[ns]
Formatted_Time             object
dtype: object

In [571]:
df2

,City,Colors Reported,Shape Reported,State,Time,newtime,Formatted_Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,1930-06-01 22:00:00,01-06-1930
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,1930-06-30 20:00:00,30-06-1930
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,1931-02-15 14:00:00,15-02-1931
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,1931-06-01 13:00:00,01-06-1931
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,1933-04-18 19:00:00,18-04-1933
...,...,...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,2000-12-31 23:00:00,2000-12-31 23:00:00,31-12-2000
18237,Spirit Lake,NaN,DISK,IA,2000-12-31 23:00:00,2000-12-31 23:00:00,31-12-2000
18238,Eagle River,NaN,NaN,WI,2000-12-31 23:45:00,2000-12-31 23:45:00,31-12-2000
18239,Eagle River,RED,LIGHT,WI,2000-12-31 23:45:00,2000-12-31 23:45:00,31-12-2000
18240,Ybor,NaN,OVAL,FL,2000-12-31 23:59:00,2000-12-31 23:59:00,31-12-2000

In [601]:
df['year']=df['Time'].dt.year

In [603]:
df['month']=df['Time'].dt.month

In [610]:
df['day']=df.Time.dt.day

In [611]:
df

,City,Colors Reported,Shape Reported,State,Time,year,month,day
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,1930,6,1
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,1930,6,30
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,1931,2,15
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,1931,6,1
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,1933,4,18
...,...,...,...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,2000-12-31 23:00:00,2000,12,31
18237,Spirit Lake,NaN,DISK,IA,2000-12-31 23:00:00,2000,12,31
18238,Eagle River,NaN,NaN,WI,2000-12-31 23:45:00,2000,12,31
18239,Eagle River,RED,LIGHT,WI,2000-12-31 23:45:00,2000,12,31
18240,Ybor,NaN,OVAL,FL,2000-12-31 23:59:00,2000,12,31

In [628]:
df['date']=df['day'].astype(str)+'-'+df['month'].astype(str)+'-'+df['year'].astype(str)

In [619]:
df.drop('date2', axis=1, inplace=True)

In [630]:
df['date']=pd.to_datetime(df['date'],format='%d-%m-%Y')

In [631]:
df.dtypes

City                       object
Colors Reported            object
Shape Reported             object
State                      object
Time               datetime64[ns]
year                        int32
month                       int32
day                         int32
date               datetime64[ns]
dtype: object

In [633]:
df['formatted_date'] = df['date'].dt.strftime('%d-%m-%Y')

In [634]:
df

,City,Colors Reported,Shape Reported,State,Time,year,month,day,date,formatted_date
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,1930,6,1,1930-06-01,01-06-1930
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,1930,6,30,1930-06-30,30-06-1930
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,1931,2,15,1931-02-15,15-02-1931
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,1931,6,1,1931-06-01,01-06-1931
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,1933,4,18,1933-04-18,18-04-1933
...,...,...,...,...,...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,2000-12-31 23:00:00,2000,12,31,2000-12-31,31-12-2000
18237,Spirit Lake,NaN,DISK,IA,2000-12-31 23:00:00,2000,12,31,2000-12-31,31-12-2000
18238,Eagle River,NaN,NaN,WI,2000-12-31 23:45:00,2000,12,31,2000-12-31,31-12-2000
18239,Eagle River,RED,LIGHT,WI,2000-12-31 23:45:00,2000,12,31,2000-12-31,31-12-2000
18240,Ybor,NaN,OVAL,FL,2000-12-31 23:59:00,2000,12,31,2000-12-31,31-12-2000

In [655]:
df['c_time']=pd.Timestamp.now().date()

In [656]:
df

,City,Colors Reported,Shape Reported,State,Time,year,month,day,date,formatted_date,currentdatetime,c_time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,1930,6,1,1930-06-01,1930-06-01,2024-11-10,2024-11-10
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,1930,6,30,1930-06-30,1930-06-30,2024-11-10,2024-11-10
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,1931,2,15,1931-02-15,1931-02-15,2024-11-10,2024-11-10
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,1931,6,1,1931-06-01,1931-06-01,2024-11-10,2024-11-10
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,1933,4,18,1933-04-18,1933-04-18,2024-11-10,2024-11-10
...,...,...,...,...,...,...,...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,2000-12-31 23:00:00,2000,12,31,2000-12-31,2000-12-31,2024-11-10,2024-11-10
18237,Spirit Lake,NaN,DISK,IA,2000-12-31 23:00:00,2000,12,31,2000-12-31,2000-12-31,2024-11-10,2024-11-10
18238,Eagle River,NaN,NaN,WI,2000-12-31 23:45:00,2000,12,31,2000-12-31,2000-12-31,2024-11-10,2024-11-10
18239,Eagle River,RED,LIGHT,WI,2000-12-31 23:45:00,2000,12,31,2000-12-31,2000-12-31,2024-11-10,2024-11-10
18240,Ybor,NaN,OVAL,FL,2000-12-31 23:59:00,2000,12,31,2000-12-31,2000-12-31,2024-11-10,2024-11-10

In [657]:
df=df.drop('currentdatetime',axis=1)

In [658]:
df['c_time']=pd.to_datetime(df['c_time'],format='%Y-%m-%d')

In [659]:
df

,City,Colors Reported,Shape Reported,State,Time,year,month,day,date,formatted_date,c_time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,1930,6,1,1930-06-01,1930-06-01,2024-11-10
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,1930,6,30,1930-06-30,1930-06-30,2024-11-10
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,1931,2,15,1931-02-15,1931-02-15,2024-11-10
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,1931,6,1,1931-06-01,1931-06-01,2024-11-10
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,1933,4,18,1933-04-18,1933-04-18,2024-11-10
...,...,...,...,...,...,...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,2000-12-31 23:00:00,2000,12,31,2000-12-31,2000-12-31,2024-11-10
18237,Spirit Lake,NaN,DISK,IA,2000-12-31 23:00:00,2000,12,31,2000-12-31,2000-12-31,2024-11-10
18238,Eagle River,NaN,NaN,WI,2000-12-31 23:45:00,2000,12,31,2000-12-31,2000-12-31,2024-11-10
18239,Eagle River,RED,LIGHT,WI,2000-12-31 23:45:00,2000,12,31,2000-12-31,2000-12-31,2024-11-10
18240,Ybor,NaN,OVAL,FL,2000-12-31 23:59:00,2000,12,31,2000-12-31,2000-12-31,2024-11-10

In [660]:
df.dtypes

City                       object
Colors Reported            object
Shape Reported             object
State                      object
Time               datetime64[ns]
year                        int32
month                       int32
day                         int32
date               datetime64[ns]
formatted_date     datetime64[ns]
c_time             datetime64[ns]
dtype: object

In [686]:
df['diff']=(df['c_time']-df['formatted_date']).dt.days / 365 *12

In [687]:
df

,City,Colors Reported,Shape Reported,State,Time,year,month,day,date,formatted_date,c_time,diff
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,1930,6,1,1930-06-01,1930-06-01,2024-11-10,1134.115068
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,1930,6,30,1930-06-30,1930-06-30,2024-11-10,1133.161644
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,1931,2,15,1931-02-15,1931-02-15,2024-11-10,1125.600000
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,1931,6,1,1931-06-01,1931-06-01,2024-11-10,1122.115068
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,1933,4,18,1933-04-18,1933-04-18,2024-11-10,1099.528767
...,...,...,...,...,...,...,...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,2000-12-31 23:00:00,2000,12,31,2000-12-31,2000-12-31,2024-11-10,286.520548
18237,Spirit Lake,NaN,DISK,IA,2000-12-31 23:00:00,2000,12,31,2000-12-31,2000-12-31,2024-11-10,286.520548
18238,Eagle River,NaN,NaN,WI,2000-12-31 23:45:00,2000,12,31,2000-12-31,2000-12-31,2024-11-10,286.520548
18239,Eagle River,RED,LIGHT,WI,2000-12-31 23:45:00,2000,12,31,2000-12-31,2000-12-31,2024-11-10,286.520548
18240,Ybor,NaN,OVAL,FL,2000-12-31 23:59:00,2000,12,31,2000-12-31,2000-12-31,2024-11-10,286.520548

In [673]:
df['diff'] = (df['c_time'] - df['formatted_date']).dt.days / 365

In [695]:
df['second']=df['Time'].dt.hour

In [704]:
df[df['Time']<='1930-06-30 22:00:00']

,City,Colors Reported,Shape Reported,State,Time,year,month,day,date,formatted_date,c_time,diff,second
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,1930,6,1,1930-06-01,1930-06-01,2024-11-10,1134.115068,22
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,1930,6,30,1930-06-30,1930-06-30,2024-11-10,1133.161644,20

In [713]:
df['Tame']=pd.Timestamp.now().strftime('%Y-%m-%d %H:%M:%S')

In [716]:
df['Tame']=pd.to_datetime(df['Tame'])

In [719]:
df.dtypes

City                       object
Colors Reported            object
Shape Reported             object
State                      object
Time               datetime64[ns]
year                        int32
month                       int32
day                         int32
date               datetime64[ns]
formatted_date     datetime64[ns]
c_time             datetime64[ns]
diff                      float64
second                      int32
Tame               datetime64[ns]
dtype: object

In [728]:
df['diff']=df['Tame']-df['date']

In [732]:
df

,City,Colors Reported,Shape Reported,State,Time,year,month,day,date,formatted_date,c_time,diff,second,Tame
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,1930,6,1,1930-06-01,1930-06-01,2024-11-10,34496 days 13:15:33,22,2024-11-10 13:15:33
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,1930,6,30,1930-06-30,1930-06-30,2024-11-10,34467 days 13:15:33,20,2024-11-10 13:15:33
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,1931,2,15,1931-02-15,1931-02-15,2024-11-10,34237 days 13:15:33,14,2024-11-10 13:15:33
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,1931,6,1,1931-06-01,1931-06-01,2024-11-10,34131 days 13:15:33,13,2024-11-10 13:15:33
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,1933,4,18,1933-04-18,1933-04-18,2024-11-10,33444 days 13:15:33,19,2024-11-10 13:15:33
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,2000-12-31 23:00:00,2000,12,31,2000-12-31,2000-12-31,2024-11-10,8715 days 13:15:33,23,2024-11-10 13:15:33
18237,Spirit Lake,NaN,DISK,IA,2000-12-31 23:00:00,2000,12,31,2000-12-31,2000-12-31,2024-11-10,8715 days 13:15:33,23,2024-11-10 13:15:33
18238,Eagle River,NaN,NaN,WI,2000-12-31 23:45:00,2000,12,31,2000-12-31,2000-12-31,2024-11-10,8715 days 13:15:33,23,2024-11-10 13:15:33
18239,Eagle River,RED,LIGHT,WI,2000-12-31 23:45:00,2000,12,31,2000-12-31,2000-12-31,2024-11-10,8715 days 13:15:33,23,2024-11-10 13:15:33
18240,Ybor,NaN,OVAL,FL,2000-12-31 23:59:00,2000,12,31,2000-12-31,2000-12-31,2024-11-10,8715 days 13:15:33,23,2024-11-10 13:15:33

In [744]:
df[df['Time'].dt.year==1944]

,City,Colors Reported,Shape Reported,State,Time,year,month,day,date,formatted_date,c_time,diff,second,Tame
24,Wilderness,NaN,DISK,WV,1944-01-01 10:00:00,1944,1,1,1944-01-01,1944-01-01,2024-11-10,29534 days 13:15:33,10,2024-11-10 13:15:33
25,San Diego,NaN,CIGAR,CA,1944-01-01 12:00:00,1944,1,1,1944-01-01,1944-01-01,2024-11-10,29534 days 13:15:33,12,2024-11-10 13:15:33
26,Wilderness,NaN,DISK,WV,1944-01-01 12:00:00,1944,1,1,1944-01-01,1944-01-01,2024-11-10,29534 days 13:15:33,12,2024-11-10 13:15:33
27,Clovis,NaN,DISK,NM,1944-04-02 11:00:00,1944,4,2,1944-04-02,1944-04-02,2024-11-10,29442 days 13:15:33,11,2024-11-10 13:15:33
28,Los Alamos,NaN,DISK,NM,1944-06-01 12:00:00,1944,6,1,1944-06-01,1944-06-01,2024-11-10,29382 days 13:15:33,12,2024-11-10 13:15:33
29,Ft. Duschene,NaN,DISK,UT,1944-06-30 10:00:00,1944,6,30,1944-06-30,1944-06-30,2024-11-10,29353 days 13:15:33,10,2024-11-10 13:15:33
30,South Kingstown,NaN,SPHERE,RI,1944-07-01 20:00:00,1944,7,1,1944-07-01,1944-07-01,2024-11-10,29352 days 13:15:33,20,2024-11-10 13:15:33
31,North Tampa,NaN,CYLINDER,FL,1944-07-15 13:00:00,1944,7,15,1944-07-15,1944-07-15,2024-11-10,29338 days 13:15:33,13,2024-11-10 13:15:33

0        2024-11-10 13:15:33
1        2024-11-10 13:15:33
2        2024-11-10 13:15:33
3        2024-11-10 13:15:33
4        2024-11-10 13:15:33
                ...
18236    2024-11-10 13:15:33
18237    2024-11-10 13:15:33
18238    2024-11-10 13:15:33
18239    2024-11-10 13:15:33
18240    2024-11-10 13:15:33
Name: Tame, Length: 18241, dtype: object

# lngth subbstrung,instring

In [761]:
df

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,2000-12-31 23:00:00
18237,Spirit Lake,NaN,DISK,IA,2000-12-31 23:00:00
18238,Eagle River,NaN,NaN,WI,2000-12-31 23:45:00
18239,Eagle River,RED,LIGHT,WI,2000-12-31 23:45:00
18240,Ybor,NaN,OVAL,FL,2000-12-31 23:59:00

<bound method Series.reset_index of City                                 Colors Reported  Shape Reported  State  Time
Aberdeen                             GREEN            FIREBALL        WA     2000-10-29 17:25:00    1
                                     ORANGE           CIRCLE          SD     1956-11-15 18:30:00    1
Acampo                               ORANGE           TEARDROP        CA     1998-09-25 20:00:00    1
Accord                               RED              TRIANGLE        NY     1977-06-20 20:30:00    1
Acton                                GREEN            FIREBALL        CA     1999-09-11 22:16:00    1
                                                                                                   ..
Yuma                                 RED              OVAL            AZ     1994-08-20 23:00:00    1
Zimmerman                            RED              LIGHT           MN     1993-02-15 01:30:00    1
no data                              ORANGE           DISK            MT     1990-11-01 23:00:00    1
                                     RED              CYLINDER        CT     1998-01-15 23:00:00    1
observer enroute on MN hwy 61 north  GREEN            SPHERE          MN     1998-10-28 20:35:00    1
Name: count, Length: 2478, dtype: int64>

# Duplicate and Null handeling

## Duplicate

In [186]:
import pandas as pd
df=pd.read_csv("layoffs.csv")

In [187]:
df

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
1,SiriusXM,New York City,Media,475.0,0.08,3/6/2023,Post-IPO,United States,525.0
2,Alerzo,Ibadan,Retail,400.0,NaN,3/6/2023,Series B,Nigeria,16.0
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
4,Loft,Sao Paulo,Real Estate,340.0,0.15,3/3/2023,Unknown,Brazil,788.0
...,...,...,...,...,...,...,...,...,...
2356,Blackbaud,Charleston,Other,500.0,0.14,NaN,Post-IPO,United States,NaN
2357,Yahoo,SF Bay Area,Consumer,1600.0,0.20,2/9/2023,Acquired,United States,6.0
2358,Hibob,Tel Aviv,HR,70.0,0.30,3/30/2020,Series A,Israel,45.0
2359,Casper,New York City,Retail,NaN,NaN,9/14/2021,Post-IPO,United States,339.0
2360,Wildlife Studios,Sao Paulo,Consumer,300.0,0.20,11/28/2022,Unknown,Brazil,260.0

In [95]:
df[df.duplicated()]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
1492,Cazoo,London,Transportation,750.0,0.15,6/7/2022,Post-IPO,United Kingdom,2000.0
2357,Yahoo,SF Bay Area,Consumer,1600.0,0.20,2/9/2023,Acquired,United States,6.0
2358,Hibob,Tel Aviv,HR,70.0,0.30,3/30/2020,Series A,Israel,45.0
2359,Casper,New York City,Retail,NaN,NaN,9/14/2021,Post-IPO,United States,339.0
2360,Wildlife Studios,Sao Paulo,Consumer,300.0,0.20,11/28/2022,Unknown,Brazil,260.0

In [41]:
#df.fillna(0, inplace=True)
#it will replace all the null value of entire table to 0(zer)

In [51]:
df[(df['country'] == 'India') & (df['percentage_laid_off'].isnull())]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
16,Flipkart,Bengaluru,Retail,NaN,NaN,3/2/2023,Acquired,India,12900.0
40,SAP Labs,Bengaluru,Other,300.0,NaN,2/24/2023,Subsidiary,India,1300.0
115,TikTok India,Mumbai,Consumer,40.0,NaN,2/10/2023,Acquired,India,9400.0
160,FarEye,New Delhi,Logistics,90.0,NaN,2/3/2023,Series E,India,150.0
...,...,...,...,...,...,...,...,...,...
2039,BlackBuck,Bengaluru,Logistics,200.0,NaN,4/17/2020,Series D,India,293.0
2198,Shuttl,New Delhi,Transportation,40.0,NaN,4/2/2020,Series C,India,122.0
2210,Capillary,Bengaluru,Retail,NaN,NaN,4/2/2020,Private Equity,India,102.0
2294,Fareportal,Gurugram,Travel,200.0,NaN,3/26/2020,Unknown,India,NaN
2341,Bounce,Bengaluru,Transportation,120.0,NaN,3/19/2020,Series D,India,214.0

In [53]:
df[df['percentage_laid_off'].isnull()]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
2,Alerzo,Ibadan,Retail,400.0,NaN,3/6/2023,Series B,Nigeria,16.0
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
6,Lendi,Sydney,Real Estate,100.0,NaN,3/3/2023,Unknown,Australia,59.0
7,UserTesting,SF Bay Area,Marketing,63.0,NaN,3/3/2023,Acquired,United States,152.0
8,Airbnb,SF Bay Area,NaN,30.0,NaN,3/3/2023,Post-IPO,United States,6400.0
...,...,...,...,...,...,...,...,...,...
2344,Lola,Boston,Travel,34.0,NaN,3/19/2020,Series C,United States,81.0
2345,Anyvision,Tel Aviv,Security,NaN,NaN,3/19/2020,Series A,Israel,74.0
2347,Tuft & Needle,Phoenix,Retail,NaN,NaN,3/19/2020,Acquired,United States,0.0
2355,EasyPost,Salt Lake City,Logistics,75.0,NaN,3/11/2020,Series A,United States,12.0
2359,Casper,New York City,Retail,NaN,NaN,9/14/2021,Post-IPO,United States,339.0

### To delete particular row after filtering

In [59]:
df.drop(df[df['company']=='Atlassian'].index,inplace=True)

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
1,SiriusXM,New York City,Media,475.0,0.08,3/6/2023,Post-IPO,United States,525.0
2,Alerzo,Ibadan,Retail,400.0,NaN,3/6/2023,Series B,Nigeria,16.0
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
4,Loft,Sao Paulo,Real Estate,340.0,0.15,3/3/2023,Unknown,Brazil,788.0
5,Embark Trucks,SF Bay Area,Transportation,230.0,0.70,3/3/2023,Post-IPO,United States,317.0
...,...,...,...,...,...,...,...,...,...
2356,Blackbaud,Charleston,Other,500.0,0.14,NaN,Post-IPO,United States,NaN
2357,Yahoo,SF Bay Area,Consumer,1600.0,0.20,2/9/2023,Acquired,United States,6.0
2358,Hibob,Tel Aviv,HR,70.0,0.30,3/30/2020,Series A,Israel,45.0
2359,Casper,New York City,Retail,NaN,NaN,9/14/2021,Post-IPO,United States,339.0
2360,Wildlife Studios,Sao Paulo,Consumer,300.0,0.20,11/28/2022,Unknown,Brazil,260.0

### Check the duplicates in entire table

In [63]:
df[df.duplicated()]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
1492,Cazoo,London,Transportation,750.0,0.15,6/7/2022,Post-IPO,United Kingdom,2000.0
2357,Yahoo,SF Bay Area,Consumer,1600.0,0.20,2/9/2023,Acquired,United States,6.0
2358,Hibob,Tel Aviv,HR,70.0,0.30,3/30/2020,Series A,Israel,45.0
2359,Casper,New York City,Retail,NaN,NaN,9/14/2021,Post-IPO,United States,339.0
2360,Wildlife Studios,Sao Paulo,Consumer,300.0,0.20,11/28/2022,Unknown,Brazil,260.0

In [85]:
df.groupby('country').agg({
    'country':['count','min','max']
})

                     country
                       count                   min                   max
country
Argentina                  6             Argentina             Argentina
Australia                 54             Australia             Australia
Austria                    3               Austria               Austria
Bahrain                    1               Bahrain               Bahrain
Belgium                    1               Belgium               Belgium
Brazil                    77                Brazil                Brazil
Bulgaria                   1              Bulgaria              Bulgaria
Canada                    99                Canada                Canada
Chile                      3                 Chile                 Chile
China                     18                 China                 China
Colombia                   4              Colombia              Colombia
Czech Republic             1        Czech Republic        Czech Republic
Denmark                    4               Denmark               Denmark
Egypt                      2                 Egypt                 Egypt
Estonia                    5               Estonia               Estonia
Finland                    4               Finland               Finland
France                     7                France                France
Germany                   68               Germany               Germany
Ghana                      1                 Ghana                 Ghana
Greece                     1                Greece                Greece
Hong Kong                  5             Hong Kong             Hong Kong
Hungary                    1               Hungary               Hungary
India                    148                 India                 India
Indonesia                 24             Indonesia             Indonesia
Ireland                    5               Ireland               Ireland
Israel                    56                Israel                Israel
Italy                      1                 Italy                 Italy
Japan                      1                 Japan                 Japan
Kenya                      6                 Kenya                 Kenya
Lithuania                  1             Lithuania             Lithuania
Luxembourg                 3            Luxembourg            Luxembourg
Malaysia                   3              Malaysia              Malaysia
Mexico                     4                Mexico                Mexico
Myanmar                    1               Myanmar               Myanmar
Netherlands               13           Netherlands           Netherlands
New Zealand                2           New Zealand           New Zealand
Nigeria                   15               Nigeria               Nigeria
Norway                     4                Norway                Norway
Pakistan                   3              Pakistan              Pakistan
Peru                       1                  Peru                  Peru
Poland                     1                Poland                Poland
Portugal                   3              Portugal              Portugal
Romania                    1               Romania               Romania
Russia                     1                Russia                Russia
Senegal                    1               Senegal               Senegal
Seychelles                 4            Seychelles            Seychelles
Singapore                 34             Singapore             Singapore
South Africa               1          South Africa          South Africa
South Korea                2           South Korea           South Korea
Spain                      3                 Spain                 Spain
Sweden                    20                Sweden                Sweden
Switzerland                2           Switzerland           Switzerland
Thailand                   1              Thailand              Thailand
Turkey                     1                Turkey                Turkey
United Arab Emirates       6  United Arab Emirates  United Arab Emirates
United Kingdom            74        United Kingdom        United Kingdom
United States           1541         United States         United States
United States.             4        United States.        United States.
Uruguay                    1               Uruguay               Uruguay
Vietnam                    3               Vietnam               Vietnam

### To drop all the dupliacte rows of table

In [90]:
df.drop_duplicates(inplace=True)

In [91]:
df

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
1,SiriusXM,New York City,Media,475.0,0.08,3/6/2023,Post-IPO,United States,525.0
2,Alerzo,Ibadan,Retail,400.0,NaN,3/6/2023,Series B,Nigeria,16.0
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
4,Loft,Sao Paulo,Real Estate,340.0,0.15,3/3/2023,Unknown,Brazil,788.0
...,...,...,...,...,...,...,...,...,...
2352,HopSkipDrive,Los Angeles,Transportation,8.0,0.10,3/13/2020,Unknown,United States,45.0
2353,Panda Squad,SF Bay Area,Consumer,6.0,0.75,3/13/2020,Seed,United States,1.0
2354,Tamara Mellon,Los Angeles,Retail,20.0,0.40,3/12/2020,Series C,United States,90.0
2355,EasyPost,Salt Lake City,Logistics,75.0,NaN,3/11/2020,Series A,United States,12.0
2356,Blackbaud,Charleston,Other,500.0,0.14,NaN,Post-IPO,United States,NaN

In [112]:
df.groupby(['company','country']).value_counts().reset_index()['count'].max()

2

In [116]:
df.drop_duplicates(subset=['company','country'],inplace=True)

In [117]:
df.groupby(['company','country']).value_counts().reset_index()['count'].max()

1

### delete duplicate of particular column

In [124]:
df.drop_duplicates(subset=['country'],inplace=True)

company                  60
location                 60
industry                 60
total_laid_off           32
percentage_laid_off      31
date                     60
stage                    60
country                  60
funds_raised_millions    52
dtype: int64

## Null

### Null value in entire table

In [130]:
df.isnull().sum()

company                    0
location                   0
industry                   4
total_laid_off           740
percentage_laid_off      785
date                       1
stage                      6
country                    0
funds_raised_millions    209
dtype: int64

### Nul value in particulr column

In [131]:
df['industry'].isnull().sum()

4

### display  records that contain null records

In [136]:
df[df['industry'].isnull()]

Empty DataFrame
Columns: [company, location, industry, total_laid_off, percentage_laid_off, date, stage, country, funds_raised_millions]
Index: []

In [ ]:
### update null value of all table

In [135]:
df.fillna(0,inplace=True)

In [140]:
df[df['industry']==0]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
8,Airbnb,SF Bay Area,0,30.0,0.00,3/3/2023,Post-IPO,United States,6400.0
330,Bally's Interactive,Providence,0,0.0,0.15,1/18/2023,Post-IPO,United States,946.0
736,Juul,SF Bay Area,0,400.0,0.30,11/10/2022,Unknown,United States,1500.0
1595,Carvana,Phoenix,0,2500.0,0.12,5/10/2022,Post-IPO,United States,1600.0

In [ ]:
### update null value of particular record/column

In [146]:
df.loc[df['industry'].isnull(),'industry']='Nitin'

In [147]:
df['industry'].isnull().sum()

0

In [148]:
df[df['industry']=='Nitin']

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
8,Airbnb,SF Bay Area,Nitin,30.0,NaN,3/3/2023,Post-IPO,United States,6400.0
330,Bally's Interactive,Providence,Nitin,NaN,0.15,1/18/2023,Post-IPO,United States,946.0
736,Juul,SF Bay Area,Nitin,400.0,0.30,11/10/2022,Unknown,United States,1500.0
1595,Carvana,Phoenix,Nitin,2500.0,0.12,5/10/2022,Post-IPO,United States,1600.0

In [152]:
df.loc[df['percentage_laid_off'].isnull(),'percentage_laid_off']=0

In [156]:
df['percentage_laid_off'].isnull().sum()

0

### bad practice

In [163]:
df.loc[(df['location']=='Mumbai') & (df['country']=='India') & (df['stage']=='Unknown'),'percentage_laid_off']=0
# bad practice
# Corrected syntax using .loc for conditional assignment
# df.loc[(df['location'] == 'Mumbai') & (df['country'] == 'India') & (df['stage'] == 'Unknown'), 'percentage_laid_off'] = 0

In [164]:
df.loc[(df['location']=='Mumbai') & (df['country']=='India') & (df['stage']=='Unknown')]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
3,UpGrad,Mumbai,Education,120.0,0.0,3/6/2023,Unknown,India,631.0
153,Pocket Aces,Mumbai,Media,50.0,0.0,2/6/2023,Unknown,India,19.0
361,Rebel Foods,Mumbai,Food,NaN,0.0,1/16/2023,Unknown,India,548.0
516,PharmEasy,Mumbai,Healthcare,NaN,0.0,12/10/2022,Unknown,India,1600.0
1438,PharmEasy,Mumbai,Healthcare,40.0,0.0,6/16/2022,Unknown,India,1600.0
1712,Bytedance,Mumbai,Consumer,1800.0,0.0,1/27/2021,Unknown,India,7400.0
1858,BookMyShow,Mumbai,Consumer,270.0,0.0,5/28/2020,Unknown,India,224.0
2221,Acko,Mumbai,Finance,45.0,0.0,4/1/2020,Unknown,India,143.0

### update null value of particular column

In [167]:
df['total_laid_off']=df['total_laid_off'].fillna('0')

In [170]:
df['total_laid_off'].isnull().sum()

0

### fill all null values of all tables

In [172]:
df.fillna(0,inplace=True)

In [173]:
df.isnull().sum()

company                  0
location                 0
industry                 0
total_laid_off           0
percentage_laid_off      0
date                     0
stage                    0
country                  0
funds_raised_millions    0
dtype: int64

### delete all null values of particular columns and all table

In [182]:
df = df.dropna(subset=['industry'])
df['industry'].isnull().sum()

0

In [183]:
df.dropna()

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
1,SiriusXM,New York City,Media,475.0,0.08,3/6/2023,Post-IPO,United States,525.0
4,Loft,Sao Paulo,Real Estate,340.0,0.15,3/3/2023,Unknown,Brazil,788.0
5,Embark Trucks,SF Bay Area,Transportation,230.0,0.70,3/3/2023,Post-IPO,United States,317.0
11,Zscaler,SF Bay Area,Security,177.0,0.03,3/2/2023,Post-IPO,United States,148.0
...,...,...,...,...,...,...,...,...,...
2353,Panda Squad,SF Bay Area,Consumer,6.0,0.75,3/13/2020,Seed,United States,1.0
2354,Tamara Mellon,Los Angeles,Retail,20.0,0.40,3/12/2020,Series C,United States,90.0
2357,Yahoo,SF Bay Area,Consumer,1600.0,0.20,2/9/2023,Acquired,United States,6.0
2358,Hibob,Tel Aviv,HR,70.0,0.30,3/30/2020,Series A,Israel,45.0
2360,Wildlife Studios,Sao Paulo,Consumer,300.0,0.20,11/28/2022,Unknown,Brazil,260.0

In [184]:
df.isnull().sum()

company                    0
location                   0
industry                   0
total_laid_off           739
percentage_laid_off      784
date                       1
stage                      6
country                    0
funds_raised_millions    209
dtype: int64

In [191]:
import numpy as np
df.loc[df['country'] == 'India', 'age'] = np.nan

In [192]:
df

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions,age
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0,NaN
1,SiriusXM,New York City,Media,475.0,0.08,3/6/2023,Post-IPO,United States,525.0,NaN
2,Alerzo,Ibadan,Retail,400.0,NaN,3/6/2023,Series B,Nigeria,16.0,NaN
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0,NaN
4,Loft,Sao Paulo,Real Estate,340.0,0.15,3/3/2023,Unknown,Brazil,788.0,NaN
...,...,...,...,...,...,...,...,...,...,...
2356,Blackbaud,Charleston,Other,500.0,0.14,NaN,Post-IPO,United States,NaN,NaN
2357,Yahoo,SF Bay Area,Consumer,1600.0,0.20,2/9/2023,Acquired,United States,6.0,NaN
2358,Hibob,Tel Aviv,HR,70.0,0.30,3/30/2020,Series A,Israel,45.0,NaN
2359,Casper,New York City,Retail,NaN,NaN,9/14/2021,Post-IPO,United States,339.0,NaN
2360,Wildlife Studios,Sao Paulo,Consumer,300.0,0.20,11/28/2022,Unknown,Brazil,260.0,NaN

# New topic

In [193]:
df

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions,age
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0,NaN
1,SiriusXM,New York City,Media,475.0,0.08,3/6/2023,Post-IPO,United States,525.0,NaN
2,Alerzo,Ibadan,Retail,400.0,NaN,3/6/2023,Series B,Nigeria,16.0,NaN
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0,NaN
4,Loft,Sao Paulo,Real Estate,340.0,0.15,3/3/2023,Unknown,Brazil,788.0,NaN
...,...,...,...,...,...,...,...,...,...,...
2356,Blackbaud,Charleston,Other,500.0,0.14,NaN,Post-IPO,United States,NaN,NaN
2357,Yahoo,SF Bay Area,Consumer,1600.0,0.20,2/9/2023,Acquired,United States,6.0,NaN
2358,Hibob,Tel Aviv,HR,70.0,0.30,3/30/2020,Series A,Israel,45.0,NaN
2359,Casper,New York City,Retail,NaN,NaN,9/14/2021,Post-IPO,United States,339.0,NaN
2360,Wildlife Studios,Sao Paulo,Consumer,300.0,0.20,11/28/2022,Unknown,Brazil,260.0,NaN

## Use of lambda

In [197]:
df['company'].apply(lambda x:x[0:3]+'-'+x[3:])

0              Atl-assian
1               Sir-iusXM
2                 Ale-rzo
3                 UpG-rad
4                   Lof-t
              ...
2356           Bla-ckbaud
2357               Yah-oo
2358               Hib-ob
2359              Cas-per
2360    Wil-dlife Studios
Name: company, Length: 2361, dtype: object

## Drop Column

In [199]:
df.drop('age',axis=1,inplace=True)

In [200]:
df

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
1,SiriusXM,New York City,Media,475.0,0.08,3/6/2023,Post-IPO,United States,525.0
2,Alerzo,Ibadan,Retail,400.0,NaN,3/6/2023,Series B,Nigeria,16.0
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
4,Loft,Sao Paulo,Real Estate,340.0,0.15,3/3/2023,Unknown,Brazil,788.0
...,...,...,...,...,...,...,...,...,...
2356,Blackbaud,Charleston,Other,500.0,0.14,NaN,Post-IPO,United States,NaN
2357,Yahoo,SF Bay Area,Consumer,1600.0,0.20,2/9/2023,Acquired,United States,6.0
2358,Hibob,Tel Aviv,HR,70.0,0.30,3/30/2020,Series A,Israel,45.0
2359,Casper,New York City,Retail,NaN,NaN,9/14/2021,Post-IPO,United States,339.0
2360,Wildlife Studios,Sao Paulo,Consumer,300.0,0.20,11/28/2022,Unknown,Brazil,260.0

In [203]:
df.rename(columns={'company':'com.'},inplace=True)

In [205]:
df

,com.,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
1,SiriusXM,New York City,Media,475.0,0.08,3/6/2023,Post-IPO,United States,525.0
2,Alerzo,Ibadan,Retail,400.0,NaN,3/6/2023,Series B,Nigeria,16.0
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
4,Loft,Sao Paulo,Real Estate,340.0,0.15,3/3/2023,Unknown,Brazil,788.0
...,...,...,...,...,...,...,...,...,...
2356,Blackbaud,Charleston,Other,500.0,0.14,NaN,Post-IPO,United States,NaN
2357,Yahoo,SF Bay Area,Consumer,1600.0,0.20,2/9/2023,Acquired,United States,6.0
2358,Hibob,Tel Aviv,HR,70.0,0.30,3/30/2020,Series A,Israel,45.0
2359,Casper,New York City,Retail,NaN,NaN,9/14/2021,Post-IPO,United States,339.0
2360,Wildlife Studios,Sao Paulo,Consumer,300.0,0.20,11/28/2022,Unknown,Brazil,260.0

In [211]:
df.describe()

       total_laid_off  percentage_laid_off  funds_raised_millions
count     1621.000000          1576.000000            2152.000000
mean       238.358421             0.257917             822.454134
std        769.718801             0.255575            5593.961626
min          3.000000             0.000000               0.000000
25%         36.000000             0.100000              50.000000
50%         80.000000             0.170000             156.500000
75%        180.000000             0.300000             445.000000
max      12000.000000             1.000000          121900.000000

# Joins and Set of sql

## Joins

In [133]:
import pandas as pd
df1=pd.read_csv(r'C:\Users\Anshu\Desktop\New folder (3)\automation testing notes\project\ETL\Raw_data\coffee\city.csv')
df2=pd.read_csv(r'C:\Users\Anshu\Desktop\New folder (3)\automation testing notes\project\ETL\Raw_data\coffee\customers.csv')

In [26]:
df1

    city_id   city_name  population  estimated_rent  city_rank
0         1   Bangalore    12300000           29700          1
1         2     Chennai    11100000           17100          6
2         3        Pune     7500000           15300          9
3         4      Jaipur     4000000           10800          8
4         5       Delhi    31000000           22500          3
5         6      Mumbai    20400000           31500          2
6         7   Hyderabad    10000000           22500          4
7         8   Ahmedabad     8300000           14400          5
8         9     Kolkata    14900000           16200          7
9        10       Surat     7200000           13500         10
10       11     Lucknow     3800000            9000         11
11       12      Kanpur     3100000            8100         12
12       13      Nagpur     2900000            7200         13
13       14      Indore     3300000            6300         14
14       15  Chandrapur       12000            3000         15

In [4]:
df2

     customer_id    customer_name  city_id
0              1    Aarav Agarwal        1
1              2     Aarav Pandey        1
2              3      Aditi Gupta        1
3              4      Aditi Joshi        1
4              5      Aditi Reddy        1
..           ...              ...      ...
492          493   Krishna Sharma       14
493          494      Mira Mishra       14
494          495     Aarav Sharma       14
495          496  Priya Chaudhary       14
496          497    Anushka Verma       14

[497 rows x 3 columns]

### Inner join

In [128]:
result=df1.merge(df2,how ='inner') ##bad practice

In [129]:
result

,city_id,city_name,population,estimated_rent,city_rank,customer_id,customer_name
0,1,Bangalore,12300000,29700,1,1,Aarav Agarwal
1,1,Bangalore,12300000,29700,1,2,Aarav Pandey
2,1,Bangalore,12300000,29700,1,3,Aditi Gupta
3,1,Bangalore,12300000,29700,1,4,Aditi Joshi
4,1,Bangalore,12300000,29700,1,5,Aditi Reddy
...,...,...,...,...,...,...,...
492,14,Indore,3300000,6300,14,493,Krishna Sharma
493,14,Indore,3300000,6300,14,494,Mira Mishra
494,14,Indore,3300000,6300,14,495,Aarav Sharma
495,14,Indore,3300000,6300,14,496,Priya Chaudhary
496,14,Indore,3300000,6300,14,497,Anushka Verma

In [134]:
result_inner=pd.merge(df1,df2, on='city_id',how='inner')

In [135]:
#merged_df = pd.merge(df1, df2, on="key_column", how="inner")
result_inner

,city_id,city_name,population,estimated_rent,city_rank,customer_id,customer_name
0,1,Bangalore,12300000,29700,1,1,Aarav Agarwal
1,1,Bangalore,12300000,29700,1,2,Aarav Pandey
2,1,Bangalore,12300000,29700,1,3,Aditi Gupta
3,1,Bangalore,12300000,29700,1,4,Aditi Joshi
4,1,Bangalore,12300000,29700,1,5,Aditi Reddy
...,...,...,...,...,...,...,...
492,14,Indore,3300000,6300,14,493,Krishna Sharma
493,14,Indore,3300000,6300,14,494,Mira Mishra
494,14,Indore,3300000,6300,14,495,Aarav Sharma
495,14,Indore,3300000,6300,14,496,Priya Chaudhary
496,14,Indore,3300000,6300,14,497,Anushka Verma

### left join

In [51]:
result=df1.merge(df2,how='left')

In [52]:
result

,city_id,city_name,population,estimated_rent,city_rank,customer_id,customer_name
0,1,Bangalore,12300000,29700,1,1.0,Aarav Agarwal
1,1,Bangalore,12300000,29700,1,2.0,Aarav Pandey
2,1,Bangalore,12300000,29700,1,3.0,Aditi Gupta
3,1,Bangalore,12300000,29700,1,4.0,Aditi Joshi
4,1,Bangalore,12300000,29700,1,5.0,Aditi Reddy
...,...,...,...,...,...,...,...
493,14,Indore,3300000,6300,14,494.0,Mira Mishra
494,14,Indore,3300000,6300,14,495.0,Aarav Sharma
495,14,Indore,3300000,6300,14,496.0,Priya Chaudhary
496,14,Indore,3300000,6300,14,497.0,Anushka Verma
497,15,Chandrapur,12000,3000,15,NaN,NaN

In [75]:
result_left=pd.merge(df1,df2,how='left')

In [76]:
result_left

,city_id,city_name,population,estimated_rent,city_rank,customer_id,customer_name
0,1,Bangalore,12300000,29700,1,1.0,Aarav Agarwal
1,1,Bangalore,12300000,29700,1,2.0,Aarav Pandey
2,1,Bangalore,12300000,29700,1,3.0,Aditi Gupta
3,1,Bangalore,12300000,29700,1,4.0,Aditi Joshi
4,1,Bangalore,12300000,29700,1,5.0,Aditi Reddy
...,...,...,...,...,...,...,...
493,14,Indore,3300000,6300,14,494.0,Mira Mishra
494,14,Indore,3300000,6300,14,495.0,Aarav Sharma
495,14,Indore,3300000,6300,14,496.0,Priya Chaudhary
496,14,Indore,3300000,6300,14,497.0,Anushka Verma
497,15,Chandrapur,12000,3000,15,NaN,NaN

In [55]:
result=pd.merge(df1,df2, on='city_id',how='left',indicator=True).query("_merge != 'both'")

In [50]:
result

,city_id,city_name,population,estimated_rent,city_rank,customer_id,customer_name,_merge
497,15,Chandrapur,12000,3000,15,NaN,NaN,left_only

### Right join

In [61]:
result=df1.merge(df2,how='right')

In [62]:
result

,city_id,city_name,population,estimated_rent,city_rank,customer_id,customer_name
0,1.0,Bangalore,12300000.0,29700.0,1.0,1,Aarav Agarwal
1,1.0,Bangalore,12300000.0,29700.0,1.0,2,Aarav Pandey
2,1.0,Bangalore,12300000.0,29700.0,1.0,3,Aditi Gupta
3,1.0,Bangalore,12300000.0,29700.0,1.0,4,Aditi Joshi
4,1.0,Bangalore,12300000.0,29700.0,1.0,5,Aditi Reddy
...,...,...,...,...,...,...,...
494,14.0,Indore,3300000.0,6300.0,14.0,495,Aarav Sharma
495,14.0,Indore,3300000.0,6300.0,14.0,496,Priya Chaudhary
496,14.0,Indore,3300000.0,6300.0,14.0,497,Anushka Verma
497,17.0,NaN,NaN,NaN,NaN,498,Nitin Gawande
498,NaN,NaN,NaN,NaN,NaN,499,Alize Maya17

In [72]:
result_right=pd.merge(df1,df2, on='city_id', how='right')

In [74]:
result_right

,city_id,city_name,population,estimated_rent,city_rank,customer_id,customer_name
0,1.0,Bangalore,12300000.0,29700.0,1.0,1,Aarav Agarwal
1,1.0,Bangalore,12300000.0,29700.0,1.0,2,Aarav Pandey
2,1.0,Bangalore,12300000.0,29700.0,1.0,3,Aditi Gupta
3,1.0,Bangalore,12300000.0,29700.0,1.0,4,Aditi Joshi
4,1.0,Bangalore,12300000.0,29700.0,1.0,5,Aditi Reddy
...,...,...,...,...,...,...,...
494,14.0,Indore,3300000.0,6300.0,14.0,495,Aarav Sharma
495,14.0,Indore,3300000.0,6300.0,14.0,496,Priya Chaudhary
496,14.0,Indore,3300000.0,6300.0,14.0,497,Anushka Verma
497,17.0,NaN,NaN,NaN,NaN,498,Nitin Gawande
498,NaN,NaN,NaN,NaN,NaN,499,Alize Maya17

In [68]:
result=pd.merge(df1,df2,on='city_id',how='right',indicator=True).query("_merge!='both'")

In [69]:
result

,city_id,city_name,population,estimated_rent,city_rank,customer_id,customer_name,_merge
497,17.0,NaN,NaN,NaN,NaN,498,Nitin Gawande,right_only
498,NaN,NaN,NaN,NaN,NaN,499,Alize Maya17,right_only

### outer

In [79]:
result=df1.merge(df2 ,how='outer')

In [80]:
result

,city_id,city_name,population,estimated_rent,city_rank,customer_id,customer_name
0,1.0,Bangalore,12300000.0,29700.0,1.0,1.0,Aarav Agarwal
1,1.0,Bangalore,12300000.0,29700.0,1.0,2.0,Aarav Pandey
2,1.0,Bangalore,12300000.0,29700.0,1.0,3.0,Aditi Gupta
3,1.0,Bangalore,12300000.0,29700.0,1.0,4.0,Aditi Joshi
4,1.0,Bangalore,12300000.0,29700.0,1.0,5.0,Aditi Reddy
...,...,...,...,...,...,...,...
495,14.0,Indore,3300000.0,6300.0,14.0,496.0,Priya Chaudhary
496,14.0,Indore,3300000.0,6300.0,14.0,497.0,Anushka Verma
497,15.0,Chandrapur,12000.0,3000.0,15.0,NaN,NaN
498,17.0,NaN,NaN,NaN,NaN,498.0,Nitin Gawande
499,NaN,NaN,NaN,NaN,NaN,499.0,Alize Maya17

In [81]:
result_outer=pd.merge(df1,df2, on='city_id', how='outer')

In [82]:
result_outer

,city_id,city_name,population,estimated_rent,city_rank,customer_id,customer_name
0,1.0,Bangalore,12300000.0,29700.0,1.0,1.0,Aarav Agarwal
1,1.0,Bangalore,12300000.0,29700.0,1.0,2.0,Aarav Pandey
2,1.0,Bangalore,12300000.0,29700.0,1.0,3.0,Aditi Gupta
3,1.0,Bangalore,12300000.0,29700.0,1.0,4.0,Aditi Joshi
4,1.0,Bangalore,12300000.0,29700.0,1.0,5.0,Aditi Reddy
...,...,...,...,...,...,...,...
495,14.0,Indore,3300000.0,6300.0,14.0,496.0,Priya Chaudhary
496,14.0,Indore,3300000.0,6300.0,14.0,497.0,Anushka Verma
497,15.0,Chandrapur,12000.0,3000.0,15.0,NaN,NaN
498,17.0,NaN,NaN,NaN,NaN,498.0,Nitin Gawande
499,NaN,NaN,NaN,NaN,NaN,499.0,Alize Maya17

In [83]:
result=pd.merge(df1,df2,on='city_id',how='outer',indicator=True).query("_merge!='both'")

In [84]:
result

,city_id,city_name,population,estimated_rent,city_rank,customer_id,customer_name,_merge
497,15.0,Chandrapur,12000.0,3000.0,15.0,NaN,NaN,left_only
498,17.0,NaN,NaN,NaN,NaN,498.0,Nitin Gawande,right_only
499,NaN,NaN,NaN,NaN,NaN,499.0,Alize Maya17,right_only

### Cross join

In [85]:
result_cross=pd.merge(df1,df2,how='cross')

In [86]:
result_cross

,city_id_x,city_name,population,estimated_rent,city_rank,customer_id,customer_name,city_id_y
0,1,Bangalore,12300000,29700,1,1,Aarav Agarwal,1.0
1,1,Bangalore,12300000,29700,1,2,Aarav Pandey,1.0
2,1,Bangalore,12300000,29700,1,3,Aditi Gupta,1.0
3,1,Bangalore,12300000,29700,1,4,Aditi Joshi,1.0
4,1,Bangalore,12300000,29700,1,5,Aditi Reddy,1.0
...,...,...,...,...,...,...,...,...
7480,15,Chandrapur,12000,3000,15,495,Aarav Sharma,14.0
7481,15,Chandrapur,12000,3000,15,496,Priya Chaudhary,14.0
7482,15,Chandrapur,12000,3000,15,497,Anushka Verma,14.0
7483,15,Chandrapur,12000,3000,15,498,Nitin Gawande,17.0
7484,15,Chandrapur,12000,3000,15,499,Alize Maya17,NaN

## Set operator of sql

In [92]:
import pandas as pd
df1=pd.read_csv(r'C:\Users\Anshu\Desktop\New folder (3)\automation testing notes\project\ETL\Raw_data\coffee\city.csv')
df2=pd.read_csv(r'C:\Users\Anshu\Desktop\New folder (3)\automation testing notes\project\ETL\Raw_data\coffee\citynew.csv')

In [ ]:
### Union

In [120]:
union=pd.concat([df2,df1]).drop_duplicates().reset_index(drop=True)

In [121]:
union

    city_id   city_name  population  estimated_rent  city_rank
0         1   Bangalore    12300000           29700          1
1         2     Chennai    11100000           17100          6
2         3        Pune     7500000           15300          9
3         4      Jaipur     4000000           10800          8
4         5       Delhi    31000000           22500          3
5         6      Mumbai    20400000           31500          2
6         7   Hyderabad    10000000           22500          4
7         8   Ahmedabad     8300000           14400          5
8         9     Kolkata    14900000           16200          7
9        10       Surat     7200000           13500         10
10       11     Lucknow     3800000            9000         11
11       12      Kanpur     3100000            8100         12
12       13      Nagpur     2900000            7200         13
13       14      Indore     3300000            6300         14
14       15  Chandrapur       12000            3000         15

In [107]:
union=pd.concat([df2,df1]).drop_duplicates()

In [108]:
union

    city_id   city_name  population  estimated_rent  city_rank
0         1   Bangalore    12300000           29700          1
1         2     Chennai    11100000           17100          6
2         3        Pune     7500000           15300          9
3         4      Jaipur     4000000           10800          8
4         5       Delhi    31000000           22500          3
5         6      Mumbai    20400000           31500          2
6         7   Hyderabad    10000000           22500          4
7         8   Ahmedabad     8300000           14400          5
8         9     Kolkata    14900000           16200          7
9        10       Surat     7200000           13500         10
10       11     Lucknow     3800000            9000         11
11       12      Kanpur     3100000            8100         12
12       13      Nagpur     2900000            7200         13
13       14      Indore     3300000            6300         14
14       15  Chandrapur       12000            3000         15
15       16  Gadchandur       10000            2500         16
16       17       Nanda        9500            2250         17

In [ ]:
### Union all

In [111]:
union_all=pd.concat([df1,df2]).reset_index(drop=True)

In [112]:
union_all

    city_id   city_name  population  estimated_rent  city_rank
0         1   Bangalore    12300000           29700          1
1         2     Chennai    11100000           17100          6
2         3        Pune     7500000           15300          9
3         4      Jaipur     4000000           10800          8
4         5       Delhi    31000000           22500          3
5         6      Mumbai    20400000           31500          2
6         7   Hyderabad    10000000           22500          4
7         8   Ahmedabad     8300000           14400          5
8         9     Kolkata    14900000           16200          7
9        10       Surat     7200000           13500         10
10       11     Lucknow     3800000            9000         11
11       12      Kanpur     3100000            8100         12
12       13      Nagpur     2900000            7200         13
13       14      Indore     3300000            6300         14
14       15  Chandrapur       12000            3000         15
15        1   Bangalore    12300000           29700          1
16        2     Chennai    11100000           17100          6
17        3        Pune     7500000           15300          9
18        4      Jaipur     4000000           10800          8
19        5       Delhi    31000000           22500          3
20        6      Mumbai    20400000           31500          2
21        7   Hyderabad    10000000           22500          4
22        8   Ahmedabad     8300000           14400          5
23        9     Kolkata    14900000           16200          7
24       10       Surat     7200000           13500         10
25       11     Lucknow     3800000            9000         11
26       12      Kanpur     3100000            8100         12
27       13      Nagpur     2900000            7200         13
28       14      Indore     3300000            6300         14
29       15  Chandrapur       12000            3000         15
30       16  Gadchandur       10000            2500         16
31       17       Nanda        9500            2250         17

In [118]:
union_all=pd.concat([df1,df2])

In [119]:
union_all

    city_id   city_name  population  estimated_rent  city_rank
0         1   Bangalore    12300000           29700          1
1         2     Chennai    11100000           17100          6
2         3        Pune     7500000           15300          9
3         4      Jaipur     4000000           10800          8
4         5       Delhi    31000000           22500          3
5         6      Mumbai    20400000           31500          2
6         7   Hyderabad    10000000           22500          4
7         8   Ahmedabad     8300000           14400          5
8         9     Kolkata    14900000           16200          7
9        10       Surat     7200000           13500         10
10       11     Lucknow     3800000            9000         11
11       12      Kanpur     3100000            8100         12
12       13      Nagpur     2900000            7200         13
13       14      Indore     3300000            6300         14
14       15  Chandrapur       12000            3000         15
0         1   Bangalore    12300000           29700          1
1         2     Chennai    11100000           17100          6
2         3        Pune     7500000           15300          9
3         4      Jaipur     4000000           10800          8
4         5       Delhi    31000000           22500          3
5         6      Mumbai    20400000           31500          2
6         7   Hyderabad    10000000           22500          4
7         8   Ahmedabad     8300000           14400          5
8         9     Kolkata    14900000           16200          7
9        10       Surat     7200000           13500         10
10       11     Lucknow     3800000            9000         11
11       12      Kanpur     3100000            8100         12
12       13      Nagpur     2900000            7200         13
13       14      Indore     3300000            6300         14
14       15  Chandrapur       12000            3000         15
15       15  Chandrapur       12000            3000         15
16       13      Nagpur     2900000            7200         13
17       14      Indore     3300000            6300         14

In [ ]:
### intersect

In [157]:
import pandas as pd
df1=pd.read_csv(r'C:\Users\Anshu\Desktop\New folder (3)\automation testing notes\project\ETL\Raw_data\coffee\city.csv')
df2=pd.read_csv(r'C:\Users\Anshu\Desktop\New folder (3)\automation testing notes\project\ETL\Raw_data\coffee\citynew.csv')

In [117]:
df2

    city_id   city_name  population  estimated_rent  city_rank
0         1   Bangalore    12300000           29700          1
1         2     Chennai    11100000           17100          6
2         3        Pune     7500000           15300          9
3         4      Jaipur     4000000           10800          8
4         5       Delhi    31000000           22500          3
5         6      Mumbai    20400000           31500          2
6         7   Hyderabad    10000000           22500          4
7         8   Ahmedabad     8300000           14400          5
8         9     Kolkata    14900000           16200          7
9        10       Surat     7200000           13500         10
10       11     Lucknow     3800000            9000         11
11       12      Kanpur     3100000            8100         12
12       13      Nagpur     2900000            7200         13
13       14      Indore     3300000            6300         14
14       15  Chandrapur       12000            3000         15
15       15  Chandrapur       12000            3000         15
16       13      Nagpur     2900000            7200         13
17       14      Indore     3300000            6300         14

### INTERSECT

In [143]:
intersect_df = pd.merge(df1, df2, how='inner')
intersect_df.drop_duplicates()

    city_id   city_name  population  estimated_rent  city_rank
0         1   Bangalore    12300000           29700          1
1         2     Chennai    11100000           17100          6
2         3        Pune     7500000           15300          9
3         4      Jaipur     4000000           10800          8
4         5       Delhi    31000000           22500          3
5         6      Mumbai    20400000           31500          2
6         7   Hyderabad    10000000           22500          4
7         8   Ahmedabad     8300000           14400          5
8         9     Kolkata    14900000           16200          7
9        10       Surat     7200000           13500         10
10       11     Lucknow     3800000            9000         11
11       12      Kanpur     3100000            8100         12
12       13      Nagpur     2900000            7200         13
14       14      Indore     3300000            6300         14
16       15  Chandrapur       12000            3000         15

In [146]:
intersect=pd.merge(df1,df2)

In [147]:
intersect

    city_id   city_name  population  estimated_rent  city_rank
0         1   Bangalore    12300000           29700          1
1         2     Chennai    11100000           17100          6
2         3        Pune     7500000           15300          9
3         4      Jaipur     4000000           10800          8
4         5       Delhi    31000000           22500          3
5         6      Mumbai    20400000           31500          2
6         7   Hyderabad    10000000           22500          4
7         8   Ahmedabad     8300000           14400          5
8         9     Kolkata    14900000           16200          7
9        10       Surat     7200000           13500         10
10       11     Lucknow     3800000            9000         11
11       12      Kanpur     3100000            8100         12
12       13      Nagpur     2900000            7200         13
13       13      Nagpur     2900000            7200         13
14       14      Indore     3300000            6300         14
15       14      Indore     3300000            6300         14
16       15  Chandrapur       12000            3000         15
17       15  Chandrapur       12000            3000         15

In [167]:
a_b=df1.merge(df2,how='outer',indicator=True).query("_merge!='both'")

In [168]:
a_b

    city_id   city_name  population  estimated_rent  city_rank      _merge
15       16  Gadchandur       10000            2500         16  right_only
16       17       Nanda        9500            2250         17  right_only

In [155]:
df1

    city_id   city_name  population  estimated_rent  city_rank
0         1   Bangalore    12300000           29700          1
1         2     Chennai    11100000           17100          6
2         3        Pune     7500000           15300          9
3         4      Jaipur     4000000           10800          8
4         5       Delhi    31000000           22500          3
5         6      Mumbai    20400000           31500          2
6         7   Hyderabad    10000000           22500          4
7         8   Ahmedabad     8300000           14400          5
8         9     Kolkata    14900000           16200          7
9        10       Surat     7200000           13500         10
10       11     Lucknow     3800000            9000         11
11       12      Kanpur     3100000            8100         12
12       13      Nagpur     2900000            7200         13
13       14      Indore     3300000            6300         14
14       15  Chandrapur       12000            3000         15

In [156]:
df2

    city_id   city_name  population  estimated_rent  city_rank
0         1   Bangalore    12300000           29700          1
1         2     Chennai    11100000           17100          6
2         3        Pune     7500000           15300          9
3         4      Jaipur     4000000           10800          8
4         5       Delhi    31000000           22500          3
5         6      Mumbai    20400000           31500          2
6         7   Hyderabad    10000000           22500          4
7         8   Ahmedabad     8300000           14400          5
8         9     Kolkata    14900000           16200          7
9        10       Surat     7200000           13500         10
10       11     Lucknow     3800000            9000         11
11       12      Kanpur     3100000            8100         12
12       13      Nagpur     2900000            7200         13
13       14      Indore     3300000            6300         14
14       15  Chandrapur       12000            3000         15
15       15  Chandrapur       12000            3000         15
16       13      Nagpur     2900000            7200         13
17       14      Indore     3300000            6300         14